{
  "columnHeaders": [
    "Improve Emotional State",
    "Clarify Career Objectives",
    "Instilling Psychological Safety",
    "Garner Knowledge and Insight",
    "Competency Development",
    "Improve Mentee's Efficiency",
    "Understanding Steps",
    "Improve Overall Quality of Ment",
    "Resolve Interpersonal Issues",
    "Remove Obstacles",
    "Mentee Expertise Development",
    "Know More About Mentee",
    "Build Personal Relationship",
    "Relationship Maintenence",
    "Build Expand Prof Network",
    "Make Sound Decisions",
    "Get Mentee Started",
    "Instill Accountability",
    "Prepared for Life",
    "Building Confidence or Efficacy",
    "Creating Opportunities",
    "Improve Quality of Work Product",
    "Promoting Adaptability",
    "Career Progression"
  ],
  "rowHeaders": [
    "Self Awareness",
    "Being Flexible",
    "Collect Information",
    "Set Expectation",
    "Ask Questions",
    "Assess Needs",
    "Assessing Interests",
    "Assess Current Skills",
    "Analyzing Issues",
    "Listening",
    "Check in",
    "Socializing with Mentee",
    "General Conversation",
    "Giving Praise",
    "Provide Reassurance",
    "Encourage Introspection",
    "Sharing Stories",
    "Share Inside Knowledge",
    "Evaluate Work",
    "Give Feedback",
    "Provide Perspective",
    "Provide Advice",
    "Walk through Process",
    "Persuasion",
    "Give Assignment",
    "Allow to Fail",
    "Provide Modeling",
    "Provide Resources",
    "Connect to Others",
    "Protecting Mentee",
    "Promote Mentee",
    "Passing on Opportunities"
  ],
  "rows": [
    [
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "B27AE1.  I spend a lot of time thinking about my own experiences and the specific processes I had to go through to learn from them, and the mistakes I made along the way, so I am better able to use my own examples to help my mentee.\nB27AE2. I spend time thinkinga bout when I have felt lost and confused and what that has felt like to better be able to relate in those situations.\nB27AE3. I don't presume what I am doing is always right for the mentee or working so I continually check in and make sure that I am actually helping the way I think I am.",
      "",
      "",
      "",
      "",
      "K3AE1. By listening carefully to mentee feedback on how I came across early in the relationship I was able to understand how people react to my style and when I might need to tone it down.\nL4AE1.  I am clear telling my mentee that I spend time reflecting on my own strengths and expertise and I think carefully about whether I am the best fit for my mentee given their needs, and if I don't think I can help them how they need it I will let them know.",
      "B23AE1.  I only take on the number of mentees that I can devote enough time to even if I'd really like to help more people in order to be fair to my current mentees whom I have committed to.",
      "",
      "",
      "",
      "",
      "",
      "B5AE1. If something doesn't go well I make sure to think about the role I played and if part of the fault is mine I concede this to my mentee and take the responsibility.",
      "",
      "",
      "",
      ""
    ],
    [
      "K9AD1.  When my mentee changed direction toward another career goal, I adjusted the direction of the mentoring to accommodate these new desires.\nK9AD2.  I determine whether or not I will lead the direction of the mentoring or let the mentee lead it depending on what they prefer and what seems to work better for our dynamic.\nL9AD1.  When my mentee confided in me about some personal issues, I helped to provide flexibility when they needed to handle some of those things.\nL9AD2.  I would keep an eye out for the return of patterns in behavior that we had been working to adjust, and when that would happen I would focus back more on those previous issues.\nL9AD3.  During times when my mentee was really immersed in deadlines, we met face to face less frequently, but I repeatedly ensured them I was here in whatever capacity they needed me during those times.\nL9AD4. I pay attention to their demands so I don't end up asking for something I know they can't deliver at that time because of the stress that small failure would present.\nL9AD5.  I try to get a sense of my mentee's moods and start with general questions, and adjust my mentoring around how open they are to talking on a particular day.",
      "",
      "",
      "",
      "L2AD1.  I adjusted the meeting frequency with my mentee at times when big things were happening to I could help anticipate challenges.\nL2AD2. When my mentee was really immersed in demands, we switched from face-to-face to phone meetings, so that I could still add value even during demanding times.\nL2AD3. I have to keep in mind that what works to help me may not work to help my mentee, as we may be wired differently, and remember that I may need to try different strategies and see what works best.\nK2AD1. We switched the focus of our mentoring meetings when we determined through conversation that my mentee had interests in some other areas of the business.\nK2AD2. When my mentee needed me to be more direct with them I was able to change my style to suit that mentee, knowing that style would not work as well on another one of my mentees.\nB2AD1.  If I come to learn that my mentee's current position is not best for growing in the direction that they desire, I will help them find what a role they need, even if it is no longer with the company.\nB2AD2. The type of support I show my mentee is sometimes more warm and supportive, and sometimes 'tough love', and I learn to sense when the toughness will be better for their ultimate development.\nB2AD4.  I look for overlaps in the frameworks of how my mentee and I each tend to approach things and try to find a way to overlap our approaches when I am helping to guide them in their development.\nB2AH1.  When I realize my mentee may have specializations or expert knowledge that I don't have, I respect that, step back,  and allow them to be the leader in situations or conversations where it is most appropriate.\nK2C1. I adjusted the frequency of our one-on-one meetings when I sensed that it would help to get a clearer sense of what my mentee was doing on a more regular basis, and asked them to give me a heads up of major events that were occurring.  ",
      "L11AD1.  I now serve as a 'mentor on call' to my mentee; when meeting at regular intervals was no longer effiicient, we have them call me when they are in need of advice or talking something through.",
      "",
      "B2AD2. The type of support I show my mentee is sometimes more warm and supportive, and sometimes 'tough love', and I learn to sense when the toughness will be better for their ultimate development.\nB2AD4.  I look for overlaps in the frameworks of how my mentee and I each tend to approach things and try to find a way to overlap our approaches when I am helping to guide them in their development.",
      "",
      "",
      "",
      "",
      "",
      "L23AD1. I try to stay on top of the most pressing and current issues happening with the mentee even if it requires changing my plans for mentoring because it is much more effective when the issues are still warm and fresh than in the past.\nL23AD2.  As we get closer I provide them with all of my forms of contact information and let them know they have unlimited access to me if they really need it.\nL23AD3.  We have a very explicit and detailed conversation about what I mean when I say my door is always open to them and I make sure they understand that if my door is literally closed and I am uninterruptable that they have other ways to reach me and they should never feel bad about reaching out when they need it.\nL23AD4. I make sure that if I really can't stop to chat with them in a particular moment that I am very specific about my next availability and I encourage them to please find me then and follow up with them if they didn't.\nL23AK3. I note that times of day/week that seem to be when my mentee tends to be most receptive and least distracted and try to schedule meetings at those times.\nB2AD2. The type of support I show my mentee is sometimes more warm and supportive, and sometimes 'tough love', and I learn to sense when the toughness will be better for their ultimate development.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "L12AE1.  Knowing my mentee never responded well to anything that could be interpreted as harsh and direct criticism, I made sure to capitalize on all opportunites for praise.",
      "L8I1. In planning the stretch assignments that I give to my mentee where they will have to re-invent themselves and be adaptable, I make sure I have the time to support them and the resources available to them that they will need so that the assignment, even when it requires them to stretch and think and act differently, will be achievable.",
      "B2AD1.  If I come to learn that my mentee's current position is not best for growing in the direction that they desire, I will help them find what a role they need, even if it is no longer with the company."
    ],
    [
      "",
      "B2AF1. We worked together on a matrix of the pros and cons of my mentee both staying and going from their position, and gathered as much information as possible to make an informed decision.",
      "B13U1.  I read some articles about developing trust to help drive engagement and turned the material into statements that I share with my mente regarding what I will do for them so they have a safe space built on trust.",
      "",
      "B2AF1. We worked together on a matrix of the pros and cons of my mentee both staying and going from their position, and gathered as much information as possible to make an informed decision.",
      "",
      "",
      "L27AF1.  I ask everyone I know who has experience mentoring if they have any activities that work well for them when they mentor that they could share with me so I can constantly develop what I do.\nL27AF2.  I speak to recruiters that I know about what they are most looking for so I can share that information with my mentees who are on the job market.\nL27AF3. When I'm attending conferences I make notes on ideas and concepts that will be helpful to share with or try with my mentees, such as techniques for presenting technical information at meetings.\nK27U1. I sit down in advance of a meeting and write down what I think may not be working as well as it should and reflect on possible reasons why and ideas for change.\nB27U1. I reflect on what I have learned about a mentee and where they currently are and I try to create a specific plan that we can work on and outline it in writing before we meet and have it in a format they could take with them.",
      "",
      "",
      "",
      "L15AF1. When I have the opportunity I will ask people whom my mentee and I both know what their impressions are so I can get a better sense of what people agree on about them.",
      "B3G1.  Determine the mentee's vision for his/her ideal mentorship by asking open-ended questions about how they want to grow and what they see for themselves in the future.",
      "",
      "B6U1. I ask for feedback from former mentees and current mentees early on so I can learn specifically the things that work the best that I should try to emphasize and what I need most to adjust moving forward.",
      "B2AF1. We worked together on a matrix of the pros and cons of my mentee both staying and going from their position, and gathered as much information as possible to make an informed decision.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    [
      "B9G1.  I use the analogy that they are the ones driving and I am the one holding the map - I will help them get where they want to go, but they are driving.\nB9G2.  We discussed what my mentee would feel comfortable with in terms of how I would present both positive and negative feedback to them and set an expectation about how we would conduct those types of conversations.\nK9G1.  I let my mentee know that if they get an opportunity that is very important to them that may interfere with something they were doing for me, it will be ok if they take it on as long as they give me notice.\nK2G1.  I tell my mentee very clearly that it is ok for them to call me and ask for help when they really feel like they can't handle something on their own.",
      "",
      "B13G1.  I help them realize that there will be a struggle when they are tyring new things, they can expect that, but they can also expect that there will not be a negative ramification from me that they had a struggle.\nK13G1.  I clearly let my mentee know that I don't think there are dumb questions or wrong things to say - they are safe to say anything to me. \nK13G2.  I let them know that I will support them during whatever challenges we work on together.\nK13G3.  I set the expectation that we will both share struggles that we are having that could interfere with our mentoring relationship and progress and that we commit to working around our setbacks.\nB13G2.  I let my mentees know that I expect them to inform me when things aren't going well or when they hit a wall or have a problem and they will be safe in being open with this information.\nL8G1. I make it clear to my mentee from the beginning that I encourage them to branch out and try new things and when they are trying new things and pushing themselves to learn to work through problems, there will be no negative ramifications from me if they fail at something.",
      "K20G1. I provide my mentee with the analogy that its like we are both in the car, and they are the ones driving and I am the one with the map helping them get where they need to go.",
      "B2G1. I provide mentee with specific exemplars of benchmarks for success that will help them model a process for growth and set difficult goals that are possible to attain.\nB2G2. I continually set slightly higher standards for my mentee to allow them to show regular improvement in the competencies on which they were seeking to improve.\nK2G1.  I tell my mentee very clearly that it is ok for them to call me and ask for help when they really feel like they can't handle something on their own.\nL1G2. At the end of each meeting where we have decided on a task for them to complete that has a deliverable, I have my mentee look at the calendar and pick a specific date that I can expect to see it.",
      "B11G1.  I made sure my mentee understood tha they should feel comfortable calling me when they really needed something rather than waiting - I named specific times that I was open to (mornings, weekends) so that they understood I really meant it.\nB11G2.  I set the expectation of how often we would meet, and that we would set up a clear agenda, but that there would always be open time to discuss any new pressing issues.\nB11G3.  I was very specific early on in not only letting them know we would work toward helping their success, but spelling out examples of ways we'd approach it.\nB11G4.  I let my mentee know that I thought it would benefit them if before we get into specific, tactical issues we tackle some big picture things first.\nB11G5.  I helped outline the expectations for my mentee's role and responsibilities in a project, and had them specifically share how they planned to meet the expectations and what they wanted to get from the role.\nL11G1.  We developed the expectation that I could pull them aside during a project and let them know in real time what could be done in a better way.\nB11G6.  I tell my mentee I'd rather have them give me a call for 5 minutes at the end of the week to get unstuck on something, and then they would have moved another iteration ahead in the goal of solving the issue in less time.",
      "",
      "K27G1. I let my mentee know that I have a method to how I mentor that I have honed over a period of time and that's how I start but I remain constantly open to the expectation and needs of particular mentees, and will communicate when I don't think I can meet those or we have to manage those.\nK27G2. I tell my mentees about other mentees I have worked with in the past (keeping their private details anonymous) so they have an idea of what I've been able to do in the past with folks in similar situations to them.\n*** note there are others in set expectation, build relationship, that are likely to fit over here too. I believe most of the references in this section are ones I did before for this column in the build relationship objective, so when we move these around, see which one of those also work when it's improving mentoring during an already going relationship.",
      "",
      "K17G1.  I clearly communicate to my mentee that if they feel like they've hit a brick wall with something that they should stop and come talk to me before they get too frustrated about it.\nB17G1. I requested that my mentee let me know when personal issues arise that will prevent them from completing deliverables so I won't be caught off guard at the last minute and we can figure out how to work around them.",
      "B10G1.  When I realized my mentee's degree of desire to improve and become expert, I continued to set higher and higher work expectations so that they would see continuous and rapid improvement.\nL10G1.  We set the expectation that we could discuss things outside of our comfort zones and not take criticisms personality, which allowed me to push the mentee in ways I couldn't otherwise.\nB2G1. I provide mentee with specific exemplars of benchmarks for success that will help them model a process for growth and set difficult goals that are possible to attain.\nB2G2. I continually set slightly higher standards for my mentee to allow them to show regular improvement in the competencies on which they were seeking to improve.",
      "",
      "B3A1. As we get to know each other I ask questions about experiences we may have had in common so I can share my perspective on those experiences.\nB3G2. I would initiate a conversation where we would each share our expectations of each other to establish a clear mentoring contract.\nB3G3.  Make sure that the mentee understood that there would be some lines of very personal conversation that I wouldn't feel comfortable crossing.\nB3G4.  Let the mentee know that if he/she had a personal issue happening that was keeping him/her from achieving deliverables, he/she didn't have to share details he/she is not comfortable sharing, but would have to keep me informed enough that I would be clear in my expectations.\nK3G1. I make it very clear  that anything that we discuss will remain as confidential as they want it to be, and if anyone asks me anything about them I will not reveal any information about our sessions or my opinion of them without their permission.\nK3G2.  I ensure that my mentee understands that anything of concern to them that they want to discuss with me, professional or personal, will be ok with me.\nL3G1. I make sure my mentee feels comfortable with me by emphasizing that our time is a welcome opportunity for them to ask any questions they have.\nL3G2.  I let my mentee know that I was going to be very direct in my feedback them, and that they should be direct with me, and that we shouldn't take any critical feedback personally.\nL3G3. I suggested that when we talk we talk frankly peer to peer and think of our conversations as mutual problem solving sessions.\nL3G4.  I assured my mentee that when we consider their unique issues and problems, I would think about their situation carefully and not give a pre-fabbed response that has worked in the past, but a genuine response to their particular situation.\nL3G5.  I told my mentee that I would be willing to work with them on what they most need but we will first have to work at building a strong and trusting relationship where they truly feel comforable with me as a person.\nL3G6.  I directly tell my mentee that they are safe with me and I will support them in whatever challenge they face and they shouldn't ever feel like something they tell me is the wrong answer or something they ask me is a dumb question, and I support this statement with nonverbal reassurance that their issues are valid.\nL3G7.  When my mentee hinted about some constraints on her future, I told them that they didn't have to tell me everything, but if they were not forthright I would not know completely how best to help them.\nL3G8. I set the stage of our relationship by offering the type of information I am comfortable sharing, and I am very open, allowing the mentee to follow suit with openness.\nK2G1.  I tell my mentee very clearly that it is ok for them to call me and ask for help when they really feel like they can't handle something on their own.\nL4G1. I had an explicit conversation with the mentee regarding whether they would like me to have conversations with others about their performance and how much involvement they would like to have in those kinds of conversations.\nL4G2.I clearly communicate to my mentee that they can come to me or call me at anytime, with anything - good or bad.\nL4G3. I let the mentee know that they can talk to me about doubts that they may not feel comfortable sharing with their manager.\nL4G4. I explicitly tell my mentee that they are safe with me and I will support them through any challenge.\nL4G5. I am very transparent with my mentee and communicate honestly about my work and my life.\nL4G6.  I emphasize with my mentee how important open communication is and that they should always be honest with me and let me know if they need us to make changes.\nL4G7.  I make it very clear that anything we talk about during mentoring sessions will be confidential and stay there unless we both decide it is something that we want to bring up outside of the relationships in order to help them.\nL4G8.  I keep the conversation focused on things relevant to their needs as a mentee and avoid raising challenging and tangential topics, like current event opinions, that may seem like I'm challenging them unnecessarily.\nB4G1. Based on an article I read on trust building, I made a list of the behaviors suggested and made a written list of these things formulated as \"I will\"statements and gave to my mentee as a commitment to a trusting relationship.\nB4G2.  I tell them I think mentoring is sort of like helping someone ride a bike - you run with them until they have it, but you have to let them wobble and sometimes fall along the way.",
      "K23G1. My mentee and I continue to share each of our goals for the relationship as it goes on to make sure that our expectations remain aligned.",
      "",
      "",
      "B18G1.  I outline specifically what I think the role of a new project consists of and have them provide me with details as to how they will meet all of the expectations of that role.\nB18G2.  We set expectations for what my role as a mentor will be in assisting my mentee on a new project and what they will need to do on their own.",
      "B1G1. I articulate for my mentee what they can gain from a current project and what role I would be able to play in helping them get to the next level.\nB1G2. I determine whether they understand a clear and proactive protocol for communicating to me when they are unable to meet their goals.\nL1G1.  I let my mentee know I don't want to micromanage them, but I do want to see them being methodical and organized, so I will require them to show me a timeline and their scheduling method so I can help them aim high.\nL1G2. At the end of each meeting where we have decided on a task for them to complete that has a deliverable, I have my mentee look at the calendar and pick a specific date that I can expect to see it.",
      "",
      "B5G1. I worked with my mentee to set a plan for the gradual steps he/she will take to continually take on progressively more challenging experiences.\nB5G2. After following a clear agenda for our meeting, we specifically articulate the outcome he/she expects coming out of the meeting and ways to make sure he/she gets there.",
      "",
      "",
      "L8G1. I make it clear to my mentee from the beginning that I encourage them to branch out and try new things and when they are trying new things and pushing themselves to learn to work through problems, there will be no negative ramifications from me if they fail at something.",
      ""
    ],
    [
      "B9A1.  When my mentee is reacting in an emotional way I try to gently ask a series of questions about why they are feeling that way to try to get all the issues out on the table and helping them talk themselves to a place where they feel calmer and we can address the issues.\nK9A1.  I ask my mentee to tell me about all the things that they are doing to take good care of themselves.",
      "K19A1.  I ask a series of very specific questions beyond \"what do you want to do\" (e.g., do you want to work internationally?) to get a clear picture of their career goals.\nK19A2.  I ask questions about the specifics of the type of company culture they would like to work for and not just the kind of work they want to do.\nK19A3. I asked detailed questions about the types of things they were doing to prepare for interviews with the intentions that my questions would provide some information about things they could start to focus on more.\nK19A4. I asked if there was any kind of dream job or ideal situation that they think about that they haven't shared with anyone before to really get at their true passions.\nL19A1. I ask my mentee to articulate exactly what it is they are trying to get out of the job they are currently in.\nK19A5. I ask the mentee to describe exactly what excited them most about each of the jobs they've had.\nL19A2. I ask them if they ever visited the city where they are interested in a job and if not ask specific questions about what they know about that city and culture to see if they are thinking about all aspectis of their potential choices.",
      "B13A1. I ask a lot of simple and straightforward questions to get them talking through their history and they can sense my interest in who they are.\nB13A2.  I ask my mentee to describe what they think coaches in general do to help (in sports, for example), and then I ask them how they can apply those things to a workplace setting to see how I could serve that coaching role for them within our mentorship.",
      "K20A1.I ask questions about my mentee and continue to probe until I can see that they are forming new self-discoveries with the answers.\nK20A2.  When my mentee appears to be taking on the same kind of role again that they keep leaving, I ask them to articulate what they think will be different this time around.\nK20A3.  I ask questions that are not loaded or said in a judgmental way, but trying to draw my mentee out and help them learn something new.\nB20A1. I ask them to really think about what their expectations had been before they did a task and whether they truly accomplished what they intended to accomplish.\nB20A2. I ask them to articulate exactly why they are interested in the career path that they are.\nB20A3.  I ask them whether they prefer to build things or to fix things and why.\nB20A4. Once I know the type of lifestyle they want to have I ask them questions about the ways that their current career path will help them get that lifestyle or could keep them from having it.\nB20A5. I ask my mentee what they think it means to \"focus on their development\" to make sure we are on the same page and have a common language.",
      "B2A1.  I ask my mentee non-directive questions so they could assess their own strengths and weaknesses following a task in order to learn how to improve.\nK2A1.  My mentee provided me with examples of questions they were planning to ask in an informational interview, and realizing some were closed questions, I said \"if I answered yes to that, what would that tell you?\" \nL8A2. When I see the same problem recurring with my mentee, I continue to ask new questions about the situation to keep bringing about new alternatives.",
      "B11A2.  Rather than tell my mentee that I thought they were in over their head with what they expected to accomplish, I asked a series of \"have you thought about…\" questions to point out where the holes were.\nB11A3.  I asked my mentee if they wanted to be working 20 hours a day and hardly sleeping, as that would be what it would take to achieve their goal using the path they were taking. This helped to set up a conversation about working more efficiently.\nL26A1. I reviewed a record of what they spent their time on and in a constructive and collaborative tone asked a series of probing questions about why they chose to do what they did, why things took so long, what choices they could have made differently, etc.\nL26A2.  I ask my mentee to think about and name who else could help them complete their tasks and if it is possible to share work or delegate, even if it isn't natural for them to do do that.\nB26A1. I asked them what would be the most helpful thing for me to do to help with their time management - monitoring their time, coaching, or a training program?",
      "K16A1.  When my mentee provides an idea of what they plan to do in a way that doesn't seem concrete, I specifically ask what the first steps are that they will take.\nL8A1.  I would ask my mentee a series of probing questions to get them to think about a current problem in ways that they hadn't considered before our interaction.",
      "K27A1.  When my mentee asks my advice on what next steps are, I first ask the question \"what do you think it would be, and why?\" before I give my take on it.\n**note the ask questions under relationship maintnence may fit here too, and we'll have to think carefully about the ways these two objectives differ- I think they do, but one might be an umbrella over the other",
      "K25A1. I asked my mentee to relay specific details about past conversations with people where they were struggling with interpersonal issues.\nK25A2. I asked my mentee to think about \"what would happen if you tried this with them?\" and named a bunch of potential approaches to see if they could anticipate the reactions of others.\nL25A1. When they are hesitating to tackle interpersonal issues, I ask a series of questions to get them to think about how these issues are affecting their performance and everyone else's in their unit so they can see the damage waiting to resolve it could be doing.",
      "K17A1. I ask them to describe why they think they may have received a lower evaluation to see if they have a tendency to blame others which may stand in the way of their improvement.",
      "L10A1.  I asked my mentee to think about how they could tap into their best strengths and bring it to a project where at first they thought they would be lacking.\nK10A1. I asked a series of detailed questions to see if they really understand everything one has to think about to build a successful business.\nB10A1.  I ask them if they are demonstrating to higher ups that they can be a key part of strategy and how.",
      "K15A1. I ask my mentee questions about any past mentor or coaching experiences they have had and what has worked best for them.\nK15A2. I ask questions about where they went to school, why they chose it, and what other types of training they have had to get them where they are.\nK15A3.  When we are still getting to know each other I ask more general questions to start, in a very open ended way, to see where the most pertinent follow-up questions will be to really get to know them more deeply.\nK15A4. I ask general questions to get to know my mentee's personal history, such as where were you born and how many siblings to they have.\nL15A1. I try to ask questions about what they have going on now because I'm trying to get a better sense of what everyday life is like for them now.\nB2G4.  I ask open-ended questions about how my mentee wants to grow and what they see for themselves in the future in order to their vision for an ideal mentoring relationship.",
      "B3C1. As I learned more about my mentee I realized that in addition to mentoring he/she may also need to be talking to a therapist to help with some very personal issues, and referred him/her to someone who was trained to help with those types of issues.\nK3A1. When we are first getting to know each other and sharing information I try to keep asking for more details (e.g., the when, where, and why questions) to really let them know I want to know and understand them.\nB2G4.  I ask open-ended questions about how my mentee wants to grow and what they see for themselves in the future in order to their vision for an ideal mentoring relationship.",
      "B23A1.  On occasion I ask my mentee if thingas are still going ok for them in the relationship and if there was any new direction we should be taking.\nB23A2.  After a meeting, I earnestly ask my mentee if the conversation went as expected, and whether they got what they hoped to get out of the meeting, being clear that I appreciate honest feedback.(**note should this also be under 'check in'?)\nB23A3.  I ask the mentee to tell me specifically how they like to receive feedback and what has worked best for them in the past.",
      "19",
      "L21A1.  I ask questions from as many angles as I can think of to try to get them to think as broadly as they can about their decision making process and potential outcomes.\nL21A2. I sometimes return to the same set of questions again and again during or across meetings to see if we have exhausted all possible answers.\nL21A3.  I ask them to clearly articulate their \"whys\", as in \"why are you pursuing your career goals?\" so that we can ensure that their choices align with their purpose.",
      "B18A1.  I ask my mentee a series of questions to see if they have done enough research on the project they are about to begin and if not encourage them to do a bit more so they can start off in the best place.",
      "",
      "L14A1. I ask a series of practical questions to see how prepared they are for opportunties and disasters, such as \"do you have a passport?\" \"do you have an emergency fund?\" etc.",
      "L5A1.  In pursuit of us getting a better understanding of my mentee's passions I asked:  In what areas are you most curious?\nK5A1. When I didn't feel like there was a lot of continued growth in my mentee, I asked them: \"how are we going to move the needle?\"",
      "",
      "B12A1.  I asked my mentee questions about how they thought an interviewer would react to each of the points on their resume so that they would realize the pieces that are less necessary and job related.\nB12A2.  When slides in a presentation didn't seem to be as good as they could be, I first asked the mentee to tell me how they could present it differently \nB12A3.  I ask the mentee exactly how they feel after completing a project and probe as to what about it made them feel that way to get at what they think they did best and worst to improve it next time.\nB12A4.  I ask the mentee a series of \"have you thought about\" type of questions when they present an idea to me and keep pushing until I see that they've considered pitfalls and consequences to decisions.",
      "L8A1.  I would ask my mentee a series of probing questions to get them to think about a current problem in ways that they hadn't considered before our interaction.\nL8A2. When I see the same problem recurring with my mentee, I continue to ask new questions about the situation to keep bringing about new alternatives.\n16",
      "K22A1. I ask them to reflect on the last interview they had that didn't result in an offer and to consider specifically what they could have done differently to be more successful."
    ],
    [
      "K2C2.  When my mentee asked me my opinion about a new position they were thinking about, I helped to point out how it related to the different things I had observed about what they tend to like and dislike doing.",
      "",
      "",
      "B20C1.  Because I don't know all of the exact technical needs in my mentee's job I make sure I ask enough questions about the details of what they do so we can pinpoint the skills they most need to focus efforts on.\nL20C1. I ask questions to figure out what my mentee truly needs and what it is that they want - we can still work on wants but it is helpful to know what is an immediate need.\nL20C2. I look carefully over my mentee's resume for gaps that will slow progress toward their goals so I can figure out their most pressing needs for assignments.",
      "K2C1. I adjusted the frequency of our one-on-one meetings when I sensed that it would help to get a clearer sense of what my mentee was doing on a more regular basis, and asked them to give me a heads up of major events that were occurring.  \nL2C2. We sat down with a job description and my mentee's individual development plan in front of us, and directly and methodically compared what they most needed to work on to be aligned for that job.\nL2C3.  I asked my mentee to think about the people that they most hold in high regard and to tell me what that person told them was their mentee's strengths.\nL2C4. I framed a question about my mentee's weaknesses as something we should consider in terms of how it might be holding them back from achieving all that they could, to help prioritize what we most need to work on.\nL2C5. I had in mind a position that my mentee could be good for and thought about what was missing from their current skill set that might keep them from succeeding at that position, to guide what we work on going forward.\nL2C6. As I learn my mentee's strengths and weaknesses, I pay attention to where they really struggle most, and if they can bring one of their stronger talents into a project to help make up for the talents they lack.\nK2C2.  When my mentee asked me my opinion about a new position they were thinking about, I helped to point out how it related to the different things I had observed about what they tend to like and dislike doing.\nK2C3.  After my mentee had made a mistake that had big consequences, we carefully discussed why it may have happened and what they would need so that they wouldn't approach a similar situation like that in the future.\nB2C3.  As I got to know my mentee, I assessed their specific strengths and weaknesses and realized what they lacked in natural abiity they made up for in effort and passion, so we had straightforward discussions that they would have to put in extra effort to succeed in the position they got, and if they did I could help them develop.\nB2C4.  I pointed out that even when working on a project where my mentee already had well-developed expertise, they could still use that experience to work on developing better skills in communicating within the organization.\nB2C5.  We spent some time together talking through all of the things that they were especially good at and which ones they enjoyed before moving to the areas they thought they needed to improve.",
      "K11C1.  I asked my mentee if they had to pick the top three things they wanted to work on, what would they be?\nK11C2.  I sat down and drafted out a specific list of the knowledge, skills, and attributes that were needed in combination for them to be succesful, and mapped those against some of the examples of conversations and situations the mentee shared with me that they found themselves in, to try to pinpoint where they had the most needs for improvement.\nK11C3. I would listen to things I heard from and about my mentee to determine if some of the patterns they were trying to get away from were emerging again, and if so we could try to dive in while these issues were 'still warm.'",
      "",
      "B27C1.  I pay attention to if and when my mentee seems to need professional help beyond what I am able to provide and kindly suggest professional counseling and help them find it if needed.",
      "",
      "",
      "K10C1.  (K2C2).  When my mentee asked me my opinion about a new position they were thinking about, I pointed out how it related to the different things I had observed about what they tend to like and dislike doing.\nL10C1.  We looked specifically at a job description she may hope to attain someday and her specific development plan that lays out current skills and capacities, and figured out what she would need to get where she needed to go.\nL10C2.  To assess current strengths and weaknesses, I asked the mentee what people typically tell them, and most especially those people they hold in high regard.\nL10C3.  We discussed whether some of the things that they believed were their weaker points would hold them back on the path that they wanted to take.\nL2C4. I framed a question about my mentee's weaknesses as something we should consider in terms of how it might be holding them back from achieving all that they could, to help prioritize what we most need to work on.\nL2C5. I had in mind a position that my mentee could be good for and thought about what was missing from their current skill set that might keep them from succeeding at that position, to guide what we work on going forward.\nL2C6. As I learn my mentee's strengths and weaknesses, I pay attention to where they really struggle most, and if they can bring one of their stronger talents into a project to help make up for the talents they lack.\nB2C4.  I pointed out that even when working on a project where my mentee already had well-developed expertise, they could still use that experience to work on developing better skills in communicating within the organization.",
      "L15C1.With their permission I review transcripts or performance reviews or whatever is relevant to them to get a sense of where their strengths are and what they should work on most from a more objective perspective beyond just asking them.\nB1C1.  I would ask the mentee to explain clearly what they are looking for in a mentoring relationship, how they want to expand and grow from the relationship, and what they see for themselves in the future.\nB1C2. I would ask the mentee to tell me one or two things that they want to most have us focus on to help them improve over the course of our mentorship.",
      "L3Q1. I ask a lot of questions to assess interests with the goal of assuring that I will be a good fit for the mentee, and I let them know that if they don't think I am it's ok to tell me.\nB3C2.  Once I learned about a personal goal he/she had I would circle back to that topic to see how he/she plans to continue to work on achieving it and remind him/her that it is important to him/her and shouldn't be put on the back burner.\nL3C1. I had a candid discussion with my mentee that if they are unhappy in their current career track, I would help them find experiences to position them to reach their long term goals, even if not with their current company\nL4C1. I told my mentee in a frank way that given what they say they want, eventually they will not be happy in their current career ladder within this company, and that I will help them get some broader experience even if it means eventually using it to leave.\nL4C2. As I share my own stories to help my mentee know I've experienced similar things, I still keep in mind and let them know that our experiences are not going to be exactly the same and we will always come back to assessing the best way to approach a problem from their own perspective.\nB2C3.  As I got to know my mentee, I assessed their specific strengths and weaknesses and realized what they lacked in natural abiity they made up for in effort and passion, so we had straightforward discussions that they would have to put in extra effort to succeed in the position they got, and if they did I could help them develop.",
      "L23A1.  I name several things that I could do in a mentoring meeting, such as monitoring work, training, and coaching, and ask what would be most helpful to their current needs.\nL23A2.  I gave my mentee very specific examples of ways (verbal, written, direct, indirect, etc.) that I could provide feedback to them and asked them to really think about what would be the most useful and least threatening to them.",
      "",
      "",
      "",
      "B1C1.  I would ask the mentee to explain clearly what they are looking for in a mentoring relationship, how they want to expand and grow from the relationship, and what they see for themselves in the future.\nB1C2. I would ask the mentee to tell me one or two things that they want to most have us focus on to help them improve over the course of our mentorship.\nK2C3.  After my mentee had made a mistake that had big consequences, we carefully discussed why it may have happened and what they would need so that they wouldn't approach a similar situation like that in the future.",
      "",
      "L2C3.  I asked my mentee to think about the people that they most hold in high regard and to tell me what that person told them was their mentee's strengths.",
      "",
      "K12C1 (same as K11C2)  I sat down and drafted out a specific list of the knowledge, skills, and attributes that were needed in combination for them to be succesful, and mapped those against some of the examples of conversations and situations the mentee shared with me that they found themselves in, to try to pinpoint where they had the most needs for improvement.\nK12C2 (same as K11c3). I would listen to things I heard from and about my mentee to determine if some of the patterns they were trying to get away from were emerging again, and if so we could try to dive in while these issues were 'still warm.'\nK2C3.  After my mentee had made a mistake that had big consequences, we carefully discussed why it may have happened and what they would need so that they wouldn't approach a similar situation like that in the future.",
      "",
      "B7C2.  I began with broad questions regarding my mentee's interests and continued to probe until we narrowed it down to what seemed to be his/her most specific interests.\nB7C3. Once I gained a clear understanding of my mentee's most specific interests we worked together to think of the experiences that would best fit those interests, and where he/she could take those in the long run.\nB7C4. I listen to the types of career interests he/she has mentioned over time and ask if they would like the opportunity to work in a related function.\nB7C5. I would use my contacts to help set up a job shadow in an area of interest I know my mentee is considering.\nL7C1.  I think about how the needs of my mentee may align with the needs of the organization and how I can help develop them in a way that can be a win-win for the mentee and the organization.\nK7C1.  I determined whether a move out of the current company would be right for my mentee, even though it would be a loss to the company.\nL2C5. I had in mind a position that my mentee could be good for and thought about what was missing from their current skill set that might keep them from succeeding at that position, to guide what we work on going forward."
    ],
    [
      "",
      "",
      "",
      "",
      "K2AD1. We switched the focus of our mentoring meetings when we determined through conversation that my mentee had interests in some other areas of the business.\nB2C5.  We spent some time together talking through all of the things that they were especially good at and which ones they enjoyed before moving to the areas they thought they needed to improve.",
      "L11Q1.  I ask my mentee to articulate what excites them the most and what they like to do, and to translate that into the types of jobs they may want to get into.\nK11R1.  We thought about how much time we would have together during the course of our mentorship and decided to work on their top two goals, and then picked our first steps for each.\nL26R1. When my mentee has felt like they have way too much on their plate, we have a conversation about what is really important to them in meeting their goals so they can work to prioritize these things in their time management plan.",
      "",
      "B27Q1. I ask specific questions so I am clear on the very specific interests that my mentee (and doesn't have) has within a specific type of work, rather than just generally what they say they are interested in.\nB27Q2. I ask as many questions regarding my mentee's dislikes as their likes to get a clearer picture of their interest profile.\nB27Q3. I ask my mentee to think about Sunday nights when they are thinking about coming into work; what specifically gets them excited?\nB27R1.  I try to get clear on where they want to be 10 to 15 years out in their career so I know ultimately what they are working toward to better be able to help now.",
      "",
      "",
      "",
      "** note:  many of the assessing interests enactments I have already written can go here too, we will decide that in the end. I am going to write a few here but they may end up redundant.\nK15Q1. I ask questions to determine the things that are most fulfilling to them to get a clear picture of their biggest aspirations.\nK15Q2. I assess not only what they do when they have a choice of things to do but why they say they do it an enjoy it to look for underlying themes in the types of things that really get them excited.\nL15Q1.  I ask them if they are having fun, and if they don't seem enthusiastic, I ask them to describe what would make their work fun for them.\nL15Q2. I try to ask more probing questions when I start to discover interests that seem inconsistent with each other to try to understand my mentee better.\nL15R1. I pay attention to how they describe their personal circumstances and aspirations to get a sense of how much money is a driver for them in determining their goals.\nL15R2. I ask them to describe as specifically as they can where they see themselves at different time points in the future (e.g., 5 years, 10 years, etc.).\nB15R1. I ask them about their personal goals in life as well as their career related goals to understand their life aspirations as a whole.\nB1C1.  I would ask the mentee to explain clearly what they are looking for in a mentoring relationship, how they want to expand and grow from the relationship, and what they see for themselves in the future.\nB2K1. My mentee and I  created a cadence for me to check in every other week or so where we would both weigh in on how we thought they were doing and if there were other opportunities we could think of for their development.",
      "L3Q2. Usually at the second meeting, after all of the preliminary stuff of the first meeting, we spend a long time just sharing background and interests to really get to know each other.\nK3Q1.  When we hit on a similar experience we had in an early conversation, I asked them a lot about it to see where we had similar reactions and interests.\nB3Q1. I make a mental note of things that they tell me interest them as we are talking so that when I plan things for us to do together in our relationship they can be things I know they'll enjoy.\nB3Q2. In order to get to know them at a deeper level I ask questions and pay attention to their responses to go beyond just what interests them to what they are truly and deeply passionate about.\nB3R1. Early on in getting to know my mentee I ask them about their big goals and what keeps them going and makes them tick so I can really understand who they are.",
      "L23AK2.  I look for some things that are unique about my mentee that I can acknowledge about them, including specific interests or traditions they may have.",
      "",
      "",
      "",
      "B1C1.  I would ask the mentee to explain clearly what they are looking for in a mentoring relationship, how they want to expand and grow from the relationship, and what they see for themselves in the future.",
      "",
      "",
      "",
      "L12R1. We look at the gap between feedback they receive on their work and the praise they would like to get, and discuss what goals to set about quality of work to get there.",
      "",
      "B7Q1. When I get a hint of something they may be interested in, I'll ask a series of interested questions to dig deeper and suggest some career paths that utilize those interests."
    ],
    [
      "",
      "",
      "",
      "",
      "B2S1.  We sit down with some paper and I ask the mentee to list all the skills they need for where they want to be, and then the skills they believe they already possess, and at what level of comfort.\nB2C5.  We spent some time together talking through all of the things that they were especially good at and which ones they enjoyed before moving to the areas they thought they needed to improve.",
      "",
      "",
      "B27S1.  I ask my mentee to honestly assess what skills they feel most comfortable with among the ones they think they need, and to be specific about the level that they think they are at.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "L7S1.  We discussed my mentees job history and current qualifications to figure out the gap between their current skill set and what they need to reach the job they dream of having.\nL7S2. We identified my mentees communication skills, leadership skills, management skills, and facilitation skills, and talked through how they could exceed expectations in demonstrating each of those skills."
    ],
    [
      "B9T1.  With one of my mentees I realized that before we worked together on specific tactical issues, we needed to step back and look at some bigger picture issues.\nB9T2.  We have a discussion where I will outline their probject role and responsibilities and I listen to them articulate how they'd meet those expectations and what they would like to get out of the role.\nB9T3.  When my mentee is struggling with an emotional issue at work, we discuss how we can help each other to make it better.\nB9T4.  When I could see that my mentee was upset and frustrated, I asked them directly to tell me frankly what was going on so I could help them.\nB9T5. I pay attention to my mentee's tone of voice and when I can tell they are feeling emotional and/or frustrated, I sympathetically listen until they can get the main issues out on the table.\nB9T6. As I'm figuring out how to present a difficult decision to my mentee, I think carefully about how my decision will impact them and how they might react to that impact.\nK9T1.  I always assess whether they are comfortable with choosing three main things they want to work on and committing to them, and I assure them if so they can choose three things they need from me that I will commit to working on, as I see it as a two way street.\nK9T2.  Once I know what it is they most need, I have a discussion where I ask them to think carefully about whether they have been or are now willing to put their whole heart into making the changes they want.\nL9T1.  I pay attention to the types of words or topics that seem to trigger an emotional reaction in my mentee, and then I will ask a series of questions to try to get to the root cause to be able to help.\nL9T2. I listen carefully to the tone and speed of my mentee's voice to determine if they are upset of frustrated and make sure they get out all that they need to say.\nL9T3.  I ask them explicitly and without judgment to explain their fears and strongest concerns to me.\nL9T4. I pay attention to the tone in emails to note if something seems off with their communication style to determine whether they may need to talk.\nL9T5.  As I got to know my mentee more I would work to develop a vision of how I anticipated they would react to particular situations so I would be prepared to help.",
      "",
      "",
      "",
      "",
      "L11T1.  We explicitly compared and contrasted how my mentee had managed a past situation against what we were looking for.\nL11T2.  Over time I shifted the conversation I would have with her about a touchy issue we were working on so it shifted from seeming like something I was just helping her grow on into having her realize this was a critical deficiency that they really needed to address.\nL11T3.  We used a process called an inhibitor resolution where we listed all of the inhibitors preventing them from getting from point A to point B, and then worked through what it would take to knock each of them down.",
      "",
      "K27T1.  If things weren't coming along the way I'd expected, I spend time thinking about what might not be working, asking them about it, and trying hard to develop a clear vision of how they tend to react in certain situations.\nB27T1.   I pay attention to my mentee's emotions and when I can tell they are frustrated or sad or dejected I try to listen carefully to how they articulate the cause of their mood and how they are reacting to me.",
      "",
      "K17T1.  I studied my mentees reactions to different situations so I could anticipate how they would react in future situations that could block progress.\nK17T2. We have a conversation called \"inhibitor resolution\" where I have the mentee exhaustively list the inhibitors they believe are keeping them going from point A to B so we can talk about how to knock them down.\nL17T1. I asked about how the mentee expected that certain individuals may resist their plans and we discussed ways to deal with that social resistance if it came up.\nL17T2. I saw that when my mentee didn't reach goals on their timeline they got frustrated and seemed to be stuck in a worrying mode, we had a conversation to put the consequences of this instance in more reasonable perspective.\nB17T1. I talked to my mentee aobut their background and culture and learned that talking about accomplishments was very uncomfortable for them because of their upbringing.\nB17T2. I saw that my mentee was naturally quite shy and introverted and it made it difficult for them to be heard in the type of organization that they were in.",
      "",
      "**note previous enactments written around body language can go here",
      "K3Y1. I listen actively and often say things like \"so if I am hearing you right, what you said was…\" to make sure I really understand where they are coming from and they know I am hearing them.",
      "L23T1. I pay close attention to my mentee's body language and other forms of nonverbal communication to get a sense of whether things were going ok for them.",
      "",
      "",
      "",
      "B2K1. My mentee and I  created a cadence for me to check in every other week or so where we would both weigh in on how we thought they were doing and if there were other opportunities we could think of for their development.",
      "",
      "",
      "",
      "L12T1.  If my mentee or I believe that they are not living up to expectations, we directly try to address what the issue is that is acting as a block, and talk through ways it can be addressed.\nL12T2. After stepping in to help with a client when my mentee was unprepared, we carefully and calmly talked through what went wrong and why they were not ready to use the strategies we had prepared in advance.\nL12T3.  I asked a series of questions to try to figure out what was causing performance problems and explored what the source of all the negativity was that my mentee was expressing.",
      "",
      "L7T1. We talked about some personal issues and responsibilities that could put some bounds on the types and locations of jobs that they'd be able to fully pursue in the future.\nB7T1. When my mentee was at a crossroads of whether to stay in career or pursue something different, we explored the choices they'd made to get them to where they were and why they made decisions at different points even though they seemed inconsistent with their original goals and education."
    ],
    [
      "L9Y1. Sometimes I sit quietly and listen very carefully to my mentee and make sure I've heard the direct and subtle things they are trying to get across before I ask any questions.\nB9Y1. I listen very carefully for even small inflections in their voice that indicates that they are having an emotional reaction to something.\nK9x3.  When my mentee is upset I try to speak with empathy and make sure they feel heard and understood, rather than trying to discredit their feelings. \nK9X4.  When my mentee was showing nervousness, I told them I was happy they were nervous because it signaled to me that they are learning and pushing the edge, and they should be proud of that.",
      "",
      "",
      "",
      "",
      "B11Y1.  I pay very close attention to not only what my mentee is saying but their nonverbal cues like expressions and posture - this helps me read them better and get a better sense of what they need from me.",
      "",
      "",
      "L25Y1.  When my mentee was upset over conflicts they have bee having with others at work, I let them talk and talk and really listened before interrupting so they could get out their frustration in a safe environment before we tried to more practically tackle their issues.",
      "",
      "",
      "L20Y1. When I believe my mentee is sharing information that will be really useful to our progress, or will help me get to understand them better, I will be sure to take careful notes while I listen to them so I won't forget anything.",
      "L3AI1.  If my mentee works at my location, I pop by to say good morning or good evening, or look in once in a while just to ask how they are doing and will have the opportunity to ask for something if they need it without feeling like they are bothering me.\nB3Y2. I let the mentee talk for a long period without interrupting so that they can get out what they need to, and then I make sure I can recap it properly in the end.\nB3X1. When I listen I am consciously expressing empathy so they know that I am really hearing what they are saying and appreciating what they are going through.",
      "L23AK1.  I pay close attention to little details my mentee provides in stories they tell so that I can ask about them later and they understand that I really listen and care.",
      "",
      "",
      "",
      "",
      "",
      "L5Y1. As my mentee talks I listen for what I call trigger words that seem to indicate places where they might have doubt and self confidence issues, and so I know where to take the conversation next to work on these issues.",
      "",
      "",
      "",
      ""
    ],
    [
      "B9AI1.  I let my mentee know that I'm thinking of them and would love to help whenever they needed it.\nL9AI1. I check in with my mentee casually and if they mention offhandedly that they are experienceing some overload, I probe a bit to figure out if there is some way I can help them.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "L3AL1. We meet for coffee and bounce ideas off of eachother in a social and relaxed setting.\nL3AI2. Once the relationship has been initiated, I contact my mentee and enthusiastically let them know that I'm looking forward to meetin gthem and beginning our mentorship.",
      "B23AI1.  I continue to check in regularly with my mentee by popping by or emailing and just asking informally how they are doing so they know I am thinking of them even if we don't have a formal meeting set up.",
      "",
      "",
      "",
      "B1K1.  I circle back with my mentee and informally check in with them on issues we had been working on previously to see how the goals we set were working out.\nB2K1. My mentee and I  created a cadence for me to check in every other week or so where we would both weigh in on how we thought they were doing and if there were other opportunities we could think of for their development.",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    [
      "B9AL1.  I spend some time with my mentee out of the work environment to help us speak more freely and be open to new insights in new surroundings.\nB9AL2.  Early as we are getting to know one another, I invite the mentee out to a coffee shop or lunch so our conversation feels more relaxed and less formal.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "** this is also a place that some previous enactments can be moved over and these may come up redundant.\nK15AL1. I join my mentee out on social events when I can so we can get to know each other in a social setting away from the office and our typical roles.\nL15AL1. I noticed that when we meet in a coffee shop the conversation is more relaxed so we do that regularly and spend some time just talking informally and having fun before we start getting into our mentoring goals.\nL15AL2. I propose different social event ideas to my mentee to make sure that we choose to do something together that they feel comfortable with and will be able to relax and have natural conversations.",
      "L3W1. I have general conversations with my mentee so that we get comfortable with one another and get used to interacting before we get into more personal issues.\nL3AL2. I take my mentee out to lunch in a relaxed setting and have fun and enjoyable conversations to get comfortable with each other and build our relationship.\nK3AL1.  When my mentee invited my spouse and I out to a social fundraising event we joined them.\nK3AL2.  I join my mentee and their friends in a group out for lunch on ocassion when invited to help build the social side of the relationship.\nK3AL3. I offer to take my mentee out, in my case boating, one time on the weekend to get to know each other in a very different social setting.\nB3AL1.  I invite my mentee and their friends or significant other out with a group, to happy hour or a meal, to have fun and remove ourselves from work talk to really get to know each other and get comfortable on a personal level.\nB3AL2. My mentee and I did some fun things together beyond just drinks and meals, like sporting events, plays, and trivia nights at a pub, to share fun experiences on a more equal level without status differentiation of the mentoring relaitonship.",
      "",
      "",
      "",
      "B18AL1.  I take my mentee out to a more social environment than the office to help them develop fresh thoughts and insightful thinking on a new project.",
      "",
      "",
      "",
      "",
      "B12AL1. We sometimes have discussions in a social setting because its easier to develop fresh thoughts and insights in a good-feeling space.",
      "",
      ""
    ],
    [
      "",
      "",
      "B13W1.  When I make general conversation with my mentee I try to avoid topics where I am not sure they would have anything to contribute so that I don't put them in a position of feeling inadequate.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "B3W1.  I ask a lot of questions that aren't directly pertaining to our mentoring goals but more to build rapport and make ourselves comfortable together, such as questions about their hobbies, family, friends, etc. ",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    [
      "B9L1.  After my mentee did something helpful I told them I didn't know what I'd do without them, and made sure other people heard the positive praise.\nB9L2.  I offer all of my mentees a very positive welcome and tell them I am honored to be working with them so that they will feel valued.\nK9L1.  I make an effort to notice all the things that are great about my mentee and I point them out and why they are great so they'll understand my sincerity.",
      "",
      "",
      "",
      "K2L1. After watching my mentee's performance in a meeting I made sure to recognize and affirm all of the positive things they did.\nK2L2. I provide actual examples to my mentee of how they demonstrated particular competencies to others in a positive way.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "B3M1. I provided reassurance to my mentee that I would never mislead them about what I would provide in a reference about them to others - they would never be blindsided.",
      "",
      "",
      "",
      "",
      "",
      "",
      "L5L1.  I cheerlead my mentee along the way of any big changes they are making to keep up their confidence that they can get through difficult challenges.\nB5L1. I make sure to tell my mentee directly and in a heartfelt way how much I value them and the ways that they help me, and thank them for what they do.",
      "",
      "L12L1.  After receiving great feedback from a client I made sure to congratulate my mentee and tell them to feel very good about the role they played in the success and how their hard work paid off.\nL12L2.  I complemment my mentee's effort as consistently as I can.",
      "",
      ""
    ],
    [
      "B9M1.  I let my mentee know I have their back, and if they are struggling as they are learning or trying something new, I will be there to help them get back on track.\nB9M2.  I clearly let them know that I see part of my responsibility as a leader to help make my mentee successful, so they know we are working together and both have a responsibility in their success.\nL9M1. When my mentee is going through a hard time I assure them that everyone has struggles and if they need to ask for time off it is understandable and not a reflection on their capabilities.",
      "",
      "B13M1.  I assure them that we have created a safe environment where there is nothing to lose by being honest.\nL8M1. As my mentee embarked on a new venture I encouraged them to recognize their own skill set, but at the same time know there is always risk, and that's ok.\nL8M2. I provide regular encouragment and reassurance  to my mentees as they adapt to a new situation.",
      "",
      "",
      "L11M1.  When I was asking for improvements in some writing I was sure to make them aware that what they were heading toward was really great, but the way they were approaching it wasn't letting that all come through.",
      "",
      "B27AM1. If I believe that I may not have been clear in explaining something and that led to confusion or subpar performance on the part of my mentee, I am quick to admit my fault and apologize.",
      "",
      "",
      "B10M1.  I explain that although I may have very particular ideas about how something should be done, I want them to use their skills and creativity to get to the end result in a way that works for them.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "B5M1.  I remind mentees that it is ok not to know everything and that people at senior levels don't know everything either.\nB5M2. Early on I reassure my mentee that I am there to help create a support structure to help them be successful in any way that I can and it is ok to be a beginner at the beginning.\nL8M1. As my mentee embarked on a new venture I encouraged them to recognize their own skill set, but at the same time know there is always risk, and that's ok.",
      "",
      "",
      "L8M1. As my mentee embarked on a new venture I encouraged them to recognize their own skill set, but at the same time know there is always risk, and that's ok.\nL8M2. I provide regular encouragment and reassurance  to my mentees as they adapt to a new situation.",
      ""
    ],
    [
      "",
      "",
      "",
      "B20AN1. I encourage my mentee to think carefully and regularly about what they have been learning through their experiences and the insight they have started to develop.\nL20AN1. I encourage my mentee to think about what is involved in a venture and really think carefully about whether it is something that they want to do.",
      "L8AN1.  After my mentee completed a task I would ask a series of questions to get them thinking about the things they did best and worst and encouaged them to do that following their performances in order to be able to adapt to unexpected situations with this kind of self-knowledge.\nL2C2. We sat down with a job description and my mentee's individual development plan in front of us, and directly and methodically compared what they most needed to work on to be aligned for that job.\nL2C3.  I asked my mentee to think about the people that they most hold in high regard and to tell me what that person told them was their mentee's strengths.\nL2C4. I framed a question about my mentee's weaknesses as something we should consider in terms of how it might be holding them back from achieving all that they could, to help prioritize what we most need to work on.\nK2C3.  After my mentee had made a mistake that had big consequences, we carefully discussed why it may have happened and what they would need so that they wouldn't approach a similar situation like that in the future.\nK2Z1.  I discussed how people in the organization make judgments about those they perceive as very motivated and those not, and phrased it all as general conversation without pointing it directly at them, to help them learn a lesson without being called out.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "K3V1. I take a lead from my mentee and if they talk about a relationship struggle I try to share something equivelant to it.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "B12AN1. After completing a training or developmental task, I encourage my mentees to take some time specifically thinking about how the learnings will help their current role and possibily different future roles.",
      "L8AN1.  After my mentee completed a task I would ask a series of questions to get them thinking about the things they did best and worst and encouaged them to do that following their performances in order to be able to adapt to unexpected situations with this kind of self-knowledge.",
      ""
    ],
    [
      "K9V1.  I tell stories of the successes I've had in my career, and make sure to highlight that changes did not happen miraculosly and that things take time and are not always perfect even when they are successful.\nK9V2.  When my mentee inquired as to whether I had any insecurities when I was starting out, I joked \"how much time do you have?\" to emphasize that I was like anyone who had plenty.\nK9V3.  I gave specific examples of times I felt insecure and pointed out how they usually ended up to be unfounded.\nK9V4. I am very open in describing personal stories of failures so that I can help my mentee learn from what I've experienced and also to realize it's ok to be honest about failure.\nK9V5. I am sure to share specific stories not only about how I have succeeded but also about the mistakes I have made and how I got past them, so that when my mentee makes mistakes they don't think it is the end of the world.\nL9V1.  I share that I've found when I sit up straight and put my hands on my armrests, I can take deeper breaths, and I can relax more in tense situations.\nL9V2. I share stories of times that I felt badly that I didn't know something but then realized that there are lots of resources to help answer questions and there is no shame in needing resources.\nL9V3. I tell them some personal stories about my life outside of work so that they know I also have the same sorts of issues that they are trying to balance with their worklife.\nL9V4.  I tell a funny story about myself in a self-deprecating way such to demonstrate that something that once seemed like a very big deal is now something that I can easily laugh about, and then I am specific about what I learned from it.\nB2V1.  I share stories of when I also felt bad and insecure after making mistakes while learning so they can see it happens to everyone and that we all get through it.\nL2V3.  I share stories where I can laugh at some of the blunders that I made along the way while trying to learn things so they can see it's ok to laugh at yourself and making mistakes is part of learning.",
      "",
      "B13V1. I spent at least an hour with my mentee after we first meet sharing history and stories to get to know each other, and then suggest the mentee go home and 'sleep on it' and decide if they are comfortable enough with me to work toward a very open and trusting relationship.\nB13V2.  Early on I offer up a private piece of information that shows my vulnerabilities in order to help build the trust needed.",
      "K20V1.  I tell a story from my past about the specific ways I was able to overcome a struggle to provide insight on the mentee's own situation",
      "L2V1. I share wisdom I have learned along the way whenever I think it is relevant to a competency they are trying to develop.\nL2V2. I share very specific stories of things that worked well for me and things I should have done differently to provide examples of things my mentee should consider trying and avoiding.\nL2V3.  I share stories where I can laugh at some of the blunders that I made along the way while trying to learn things so they can see it's ok to laugh at yourself and making mistakes is part of learning.\nL2V4. Although I will always share a relevant story with a mentee if they ask me, I don't want to spend too much time talking about myself and make sure I am spending more time asking them questions and then working with examples that are relevant to their own world.\nK2V1.  If a relevant example in my life pops into my head as we are talking about something the mentee is thinking about, I try to be sure to share it with them at the time and specifically point out what was and wasn't successful for me in that situation.\nB2V1.  I share stories of when I also felt bad and insecure after making mistakes while learning so they can see it happens to everyone and that we all get through it.",
      "K11V1.  I shared a story about a time when a project was delayed for reasons outside my control, but how I began to meet with people involved to plant the seeds of the work so that we could hit the ground running when we had the green light.\nK11V2. Whenever a relevant story pops into my mind that can help provide an example of what has and has not worked for me in the past, I share it with my mentee.",
      "",
      "L2V4. Although I will always share a relevant story with a mentee if they ask me, I don't want to spend too much time talking about myself and make sure I am spending more time asking them questions and then working with examples that are relevant to their own world.",
      "",
      "",
      "",
      "",
      "K3V2. We exchange stories of experiences and family and vacations and things like that to get to know each other and understand commonalities.\nB3V1. We share background information and stories about each other and then I suggest they go home and 'sleep on' whether they feel comfortable enough talking with me to have me be their mentor.\nB4V1. Early on in the relationship I share a piece of very personal information to show that I am trusting them in order to expediate mutual feelings of trust.",
      "",
      "",
      "",
      "",
      "",
      "L14V1. I shared a story of a time when I was audited and how I found myself in that position and what it felt like to demostrate it can happen to anyone.\nL14V2. I tell stories of fears I had when I was younger and unsure of myself and struggling to make ends meet and how I got through it and perservered to better times.",
      "",
      "",
      "",
      "L8V1. I share stories of the pitfalls I have hit along the way and how I've learned and adapted because of them.",
      ""
    ],
    [
      "K9Z1.  I let the mentee know in certain businesses, people have to make very fast decisions about whether to hire, train, or retain someone, and so sometimes people do not get a second chance.",
      "",
      "",
      "B20Z1. I share some of the political workings of the organization to help my mentee gain insight on the best way to get others to support them.\nB20Z2. I shared information on the proper ettiquite and protocol of internal communication depending on the level of the person and the topic at hand.\nB20Z3.  I let my mentee know how flexible the work time policies actually are in the organization so they will know how to ulilize them properly.\nL20Z1. I shared the types of conversations that tend to go on in employee review meetings so they'd have an idea of the qualities that are seen as most valuable and those that are brought up most often as red flags.",
      "K2Z1.  I discussed how people in the organization make judgments about those they perceive as very motivated and those not, and phrased it all as general conversation without pointing it directly at them, to help them learn a lesson without being called out.\nK2Z2.  I shared the way people typically address and communicate with people in the organization depending on their role and level, so mymentee would understand the expected norms from the start. \nK2Z5. I let my mentee know that in the line of work they are in, sometimes the decision is made very early whether to train a new hire or let them go. ",
      "K11Z1.  When the option to do something in a certain way that I know is a mistake comes up in conversation, I humorously say to the mentee \"By the way, someone did it that way. Have you ever heard of that project? No?  Well, that's why.\"\nB11Z1.  I explained to my mentee the thought process behind how hires have been made and that when you hire someone you are hiring a resource, and you need to think about the most needed resources.\nB11Z2.  I spent a lot of time just explaining some aspects of the nature of our particular business that no one had ever discussed with them before, to give them a more nuanced understanding.\nB11Z3. I explained how important exposure to all parts of the organization would be to helping my mentee, and we worked out a specific plan for times and people we'd have them observe and speak with.\nB11Z4. We had a conversation about what the spoken and unspoken rules were in the organization and made sure there was a clear understanding of how both operated.\nB11Z5. We discussed how best to approach requests for time off and when the best timing of that would be to maintain efficient workflow.\nB11Z6.  We talked about ways that people handle working with others located in different time zones and managing it to minimize inconvenience",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "B6AA1. I emphasize to the mentee that all of the people they meet can influence their career, and also that they themselves have the ability to influence those people too.\nB6Z2. I explain exactly why certain people within the field or organization are particularly good to know and how they can be of help.",
      "K21Z1. I share inside knowledge about their organization when I am able to that might help them make better decisions within that organization than they would have without that information.\nK21Z2. I try to tell my mentee about times that projects have failed because of the way decisions had been made that they may never have heard about before to help guide their process.\nL21Z1.I explain the differences between how things may tend to work in a larger corporation vs. a smaller one to give them some things to consider in decision making in those environments.\nL21Z2. I share information about the current economic and cultural environment of the city where they plan to work to give them a sense of risks they may be taking.\nB21Z2. I try to share information about what their particular field of interest is really like that outsiders don't always see so they can make a sound decision about their desire to work in that area.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "K7Z1.  I let my mentees know how companies often monitor social media sites and they should google themselves often and make sure there isn't anything out there that could hurt them.\nK7Z2.  I explain the types of things that I hear employers discussing regarding what they are really looking for in the employees they hire."
    ],
    [
      "",
      "",
      "",
      "",
      "L2N1. I reviewed according to standards what my mentee had been doing on a project up to this point to get a sense of whether they'd likely to be able to take on more responsibilities in that particular area without addiitonal help or training.\nK2N1.  I reviewed my mentee's business plan to see if it was complete and clear.\nL2K1. I tried to monitor my mentee's performance in real time whenever I could so it would be a live learning experience and that feedback I would provide could happen when it was 'still warm.'\nL2K2. If my mentee worked close by me I asked them to come find me when they were in the middle of a performance problem to see if I would be able to talk it out with them while it was happening.\nL2K3. On a regular basis I ask the mentee to report how they are doing at meeting the expectations we set and what might be some challenges in their growth.",
      "",
      "",
      "",
      "",
      "",
      "L10N1.  I reviewed a proposal that my mentee did and pointed out places where the audience would likely find it unclear and discussed how they could fix it.",
      "L15K1. If I have the opportunity I try to observe my mentee in their work setting performing their typical activities so I can get a better sense of who they are and how they operate.",
      "",
      "",
      "",
      "",
      "",
      "B1K1.  I circle back with my mentee and informally check in with them on issues we had been working on previously to see how the goals we set were working out.\nB2K1. My mentee and I  created a cadence for me to check in every other week or so where we would both weigh in on how we thought they were doing and if there were other opportunities we could think of for their development.",
      "",
      "",
      "",
      "L12K1.  When I encounter others that work with my mentee I try to get a sense of how things are going, and then if I get feedback that sounds like they are continuing to struggle with the things we've been working on, we can dive deeper into the issue.\nL12K2.  I would watch my mentee to try to get a sense of whether they were doing things with their own style and not acting as if they were pigeonholed into doing things exactly the way that I typically do.\nL12K3. With my mentee's permission we review their performance evaluations together to get a clear picture of how they were being evaluated in the official documents.\nL12K4. I ask around my informal network to get a sense of how others view my mentee's work performance.\nL12O1.  After watching my mentee handle  an interaction, we debriefed and talked about the way the conversation went step by step.\nL12O2. I do an after-event review with my mentee to discuss how and why the event happenned and who the key players were, and determined if we needed more information to come to a complete understanding.\nL12O3.  After my mentee had an important interview we carefully reviewed the details of the questions and their answers.\nL12O4.  After my mentee was able to complete a task after asking someone with experience for assistance, I asked them to walk through exactly what they were taught and why it was helpful to help them process the experience and learn from it.\nB12O1.  We sit down together and review a piece of communication my mentee put together and figure out how to make it more powerful and dynamic.\nB12O2.  After a work performance, I walk through the details of each small part of it and we reflect on how each part worked and how others reacted in a very granular fashion.\nB12O3. When there was concern expressed about work quality we pull some samples of work and review the details and the specifics of what doesn't match expectations.",
      "",
      ""
    ],
    [
      "B9B2.  I provided feedback in general terms that I thought they might react to better; I told them this is what they could expect from other people when the mentee acts passive, and here is what they can expect when the mentee acts aggressively.\nB9B3. Rather than directly tell my mentee they weren't motivated enough, I provided a positive and inspiring picture of what would happen if other people could see their motivation more.\nK9B1.  I observed my mentee in a meeting and gave positive feedback on their actions, and told them how those actions indicated specific strengths that they have.",
      "",
      "",
      "",
      "B2B1.  Following a failed attempt at a task, I would directly ask how he/she would approach the task differently the next time.\nB2B3. Provided feedback in a constructive way during one-on-one meetings at regular intervals during each part of a long-term project.\nB2B4. Adjust the mode of providing feedback so that more technical questions can be addressed in a brief email, but more complex issues, such as navigating politics and reading social cues, are given face to face.\nL2B8. When I provide constructive feedback I always stress what they could do differently in the future and why, with a clear explanation of why it would be helpful. By using the future language, it sounds less like a reprimand of what they did in the past, and more like a developmental suggestion, which is easier to hear.\nL2B9. I make sure to note the speed at which I give feedback and the amount of information I provide so it is detailed enough to be clear and slow enough to be heard and absorbed.\nL2B10. After a mentee turned in subpar work that I knew was below their talent level, I directly told them that I knew they could do much better and would have to work to their capability, rather than indicating in any way that I doubted their talent based on that work.\nL2B11. After closely monitoring a mentee's work on a particular task and not seeing improvement, I directly told them that I needed to leave them to work on it themselves because the organization needed them to feel comfortable working on it independently and that wouldn't happen if I was always there.\nL2B12.  When I felt my mentee was underappreciated, I told them \"look, you are unbelievably intelligent and bring such high value, and you're not being perceived to be as high value as you are.\"\nL2B13. When my mentee was very late for a meeting because of traffic, I gently but firmly pointed out that if it was a job interview, they would not be considered.\nL2B14. I will directly let my mentee know when I do not think something is correct, but if they are sure about it I stand behind their choices, as ultimately they are in charge of their choices.\nK2B1. Even if it isn't comfortable, I give feedback directly on my mentee's professionalism, including appearance and communication style, being gentle but direct and letting them know why something is not appropriate and how it can be adjusted.\nK2B2.  I carefully read through written work completed by my mentee and heavily edit it where needed, and then sit with them and explain the meaning behind each change, making sure the improvement is clear and they would know how to do it themselves.\nK2B4. I am willing to sit by them and help them with a certain work activity to a point, but if I feel they have become to reliant on me I let them know how important it is for them to learn to do it independently.\nK2B5.  I keep a constant flow of communication going around individual development and growth, but when we get into an area with a really tough gap, I make sure that we have a frank and straightforward conversation about exactly what is needed from them and how important it is that they focus energy on closing the gap.\nK2b6.  After observing my mentee's nonverbal communication while they spoke to me in meetings I let them know that they are incredibly intelligent and have such high value, but they aren't being perceived as having as much value as they do because of their lack of attention to nonverbals.\nK2b7. I went to visit my mentee in their place of business to provide feedback on the impression it was giving to people who visit, about the place and about the mentee.\nK2B8.  I had my mentee review the details of a situation that did not go the way they wanted and as the story unfolded we stopped at several points to discuss how the mentee's behavior might have contributed to the outcome.\nK2B9.  Together we walk through the mentee's writing line by line and I point out problematic issues and why they are problematic, and guide them to think about potential solutions and work on revisions.\nK2L1. After watching my mentee's performance in a meeting I made sure to recognize and affirm all of the positive things they did.",
      "B11B1.  By meeting at frequent and regular intervals to give feedback on smaller portions of a project as it progressed, my mentee was able to finish the project more efficiency and improve their performance rating.\nB11B2.  If I were providing feedback on the technical or mechanical aspects of a project, I'd do that via email or a quick call, but if I were providing higher level more conceptual feedback we would meet in person for a deeper discussion where I could read their reactions.\nL11B1.  When I give feedback on writing I provide extremely specific suggestions for ways to approach problems rather than general comments so they have a clear place to start when they approach a revision to their work.",
      "",
      "",
      "",
      "",
      "",
      "",
      "L4D1.  I am very honest about the things that I am good at and the things I am still not good at, so my mentee can see that everyone still struggles with some things and are still trying to grow.",
      "",
      "",
      "K21AH2. Once the mentee has made a decision on a course of action on their own, I provide feedback on what I think is good about their approach and the place that they could anticipate challenges so we can discuss how those could be handled.",
      "",
      "",
      "",
      "B5B1. Provided feeback in a very encouraging manner during the rehearsal of a nerve wracking task.\nK5B1. I enthusiastically emphasize their positive accomplishments to date and encourage them to realize they are worth being proud of and celebrating.\nK5B2. I list out all of their accomplishments and how important it is for others to realize what they are doing.\nL5B1.In the wake of a bad day I would gently remind the mentee that bad days are expected to happen sometime and that I am still confident in their ability to stick to the plans that we've built.\nL5B2. When my mentee seems doubtful in their ability to complete a product, I would express surprise that there would even by a doubt in their minds, because I have no doubts that they can get it done.",
      "",
      "B12B1.  I helped improve my mentee's resume by giving feedback on the elements that were highlighting their achievements and those that seemed like padding but weren't really important.\nB12B2.  I gave my mentee constructive feedback after reviewing a work product and was very specific about ways that it could improve that they likely wouldn't have otherwise thought of.\nB12B3.  I reviewed the slides for a presentation my mentee was doing and on the slides that didn't feel right, I didn't just make suggestions but tried to understand their thought process behind presenting it in that way so I could see if there was any misunderstanding about the goal of the product.\nB12B4.  I let my mentee know that I sincerely think they do great work when they are motivated, but that their work suffers tangibly when they are not.\nB12B5. I make sure that I keep the feedback focused on how to improve the task or behaviors and not present it in a way that sounds like I'm criticizing a quality of the person.\nB12B6.  I provide written feedback to a mentee reviewing how they had identified a gap and how they fixed it, and how that would change procedures.\nB12B7.  If a mentee seemed to be procrastinating and I know this is a problem for them I would directly call them out on this and seriously state the need for us to work on time management.",
      "",
      ""
    ],
    [
      "B9D1. I encouraged my mentee to think about themselves differently by getting her to write and post positive affirmations that they would read to start the day.\nB9D2.  When I would hear my mentee say something negative, I would stop and say let's think about what you just said, can we frame it in a more positive context?\nB9D3.  My mentee often finds themselves surrounded at work by what we'd term the negative vortex; when we used that language, they realized they'd have to seek out positive people to help them avoid being \"sucked into the vortex.\"  \nB9D5.  When my mentee would feel pulled by negative forces I explained it was natural to feel negative sometimes and they shouldn't beat themselves up about it, but it was in their power to pull themselves out of the negativity by taking another perspective on the situation.\nL9D1.  When my mentee was upset because they were interpreting their supervisor's feedback in a very negative light, I reframed what the supervisor was trying to say in a way that got the point across without seeming like a personal attack.\nB9D6.  I helped my mentee recognize that they were tasked with making a change and the fact that people are agitated indicates that change is really happening, and that should be perceived as a positive, not negative, sign.",
      "K19D1. I make the connections between what they are working on now and how it will help them with future goals, especially when the connection may not seem obvious.\nK19D3. I remind my mentee that this is their career, every day - their career is not something that happens in the future, but they are building on it day by day and they have control over where it goes.",
      "",
      "K20D1. I ask them to look at something that they've done through the eyes of their boss and their bosses boss.\nB20D1. I try to continually make a connection between the processess in the organization and what they do and the big picture of what the organization is all about.\nL20D1. I provide ideas about the possible answers they may receive after an inquiry so we can talk about how they would handle each of them.\nL20D2. I made a list of the key knowledge, skills, and attributes that they most needed to develop in conjunction with each other, and then mapped those back to some of the conversations and situations they were struggling with to show how improving in those areas would help these scenarios.",
      "L2D1. Together we created a list of opportunities to volunteer for assignments that tend to come up during their typical workdays, and thought about how they can look at those opportunities specifically as ways to develop needed competencies.\nL2D2. When a mentee wanted to take a course in an area I believed they were already quite competent, I gave my perspective on it, but when they still were eager to explore it, I supported them in trying it out to find out for themselves that it was something they were already good at.\nL2D3.  I always first listen to the mentee's perspective on the best way to approach a task, and then provide a bunch of alternative ways to see the issue so they have more to think about, without telling them directly what to do.\nL2D4.  I looked at a piece of work my mentee put together as if I were a client or customer, and presented my perspective on how it came across from that vantage point.\nL2D5. When my mentee was nervous about the magnitude of a task, I told them I was happy that they were nervous because it meant they were learning and pushing the edge, and that's exactly what I was hoping they would do.",
      "B11D1.  I suggest that my mentee look at the project from the viewpoint of anyone else who will come into contact with it - what would they look for, and what would they see?\nB11D2.  I ask my mentee to think about their problems from different angles and consider the likelihood of the worst possible consequences to put the challenge in perspective.",
      "K16D1.  I helped my mentee break down a bigger task that seemed daunting into very specific steps with a very specific timeline so they had small and specific, clear tasks to do.\nK16D2.  I relate the specific steps that they are doing in pursuit of a project back to their larger goals so they can see how these steps are helpful more generally.\nL16D1. When my mentee seems overwhelmed I remind them that they can only take one thing at a time and they can't worry about everything at once or nothing will get accomplished.\nB16D1. Sometimes I draw out a flow chart of the steps involved in doing a task so they can envision it in a more concrete way.\nL16D2.  I 'paint a picture' of the possible future for my mentee to get them excited and then once we share an image that we like, I provide some of the early steps to get them on that path toward making it a reality.",
      "",
      "L25D1. As my mentee described times that they got frustrated with coworkers, I pointed out that they seemed to happen when the mentee was feeling particularly overwhelmed and may not have had the energy to handle the situation as best they could.\nL25D2. I helped my mentee see that some of the people they were interacting with see themselves in a certain way and so the way that my mentee chooses to approach them should help them keep that self-image in tact.",
      "K17D1.  I remind my mentee of how much authority/autonomy they have to carry out their plans of action.",
      "",
      "",
      "L4E1. I encourage a mentee who may need to explore bigger opportunitis to get what they want to get a headhunter.",
      "",
      "L6D1.  We have a conversation about who the mentee considers relevant contacts, and I suggest different ways to think about contacts, including resources like neighbors, friends of relatives, etc.\nL6D2.  I had my mentee think about all the people they knew even casually outside of a work context, and then think of what those people all did for a living to see if any of them could be thought of as resources when considered in that different light.",
      "B21D1. I tell my mentee how others in their position have gone through a decision making process that was similar, and how course correcting them midstream had led to successes to allow them to be open to that.\nB21D2. I help my mentee try to think about how the idea they want to pursue will be viewed by various stakeholders.\nK21AH1. I am careful not to come across as if I am telling my mentee what they should do, but rather discussing options and their likely outcomes and then letting them think about them and decide.",
      "K18D1. When hesitating to start on a project I thought would be valuable, I reminded them how much what they learned from the experience would be useful to them later on and to the organizaiton.",
      "",
      "",
      "B5D1.  Demonstrated how he/she could reframe negative statements about things that had happened to him/her into more positive and helpful statements, and to take note of when he/she was starting to sink into a negative vortex of thought to be able to stop it.\nB5D2. When my mentee struggled with reframing statements in a more positive way, I would provide some suggestions of more positive frames, and ask him/her to reflect on the differences in feelings he/she got from the negative vs. the positive statements to see in real time how these reframes could make a difference.\nL5E2.  I suggest that they set long term goals for all areas of life, including things like community service.",
      "",
      "L12D1.  When my mentee received feedback that they were repeatedly turning in work with errors, we reviewed the feedback and tried to read between the lines of the feedback and figure out together what could have mitigated those instances.\nB12D1. I remind my mentee that they are not expected to always be experts at everything and it is ok to have questions.",
      "L8D1.  I use examples from our own effective communication that I've modeled in our relationship to help demonstrate how to tailor communications with different types of people my mentee will encounter.\nL8D2.  I discuss the distinction between being flexible and adaptable, to be able to effectively reach a goal, versus being wishy-washy.",
      "L7D1.  When my mentee gets frustrated and lost in the minutia of certain tedious but necessary tasks, I shift their perspective by helping describe how in the big picture the experience will be a benefit and value to them, and encourage them to learn to do that on on their own.\nL22D1. I encouraged my mentee to really think about how they come across to a hiring manager in the context of the current market when they think about how they will present themselves in an interview."
    ],
    [
      "B9E1.  I suggested to my mentee that when they had very techical questions that they are struggling with, they should not hesitate to go talk to individuals who have that expertise, and I am happy to help identify those experts for them.\nB9E2.  I reminded my mentee that even if this is not the place they want to stay, while they are here for 40 hours getting paid, it's in their best interest to focus and get as much done as they can while they are here.\nB9E3.  I stress how important it is for those aspiring to be leaders to take care of themselves in all aspects, including exercise, sleeping, eating, and personal relationships.\nB9E4.  I advise my mentees to find some kind of mindful practice that suits them - meditation, walking in nature, etc. - that will help sustain them and open them up to the larger world.\nB9E5.  I encourage my mentees to give themselves credit for what they accomplish; even if there are ups and downs, they should recognize when their hard work paid off and ackowledge it.\nK9E1.  I remind my mentee what they've expressed is most important to them and when an opportunity, personal or professional, is aligned with those things, I advise them to consider it.\nK9E2.  I encouraged my mentee at certain points when they were overwhlemed to slow down a bit and take car of themselves so they wouldn't become ill or burned out.  \nK9E3. I advised my mentee to take one of their vacation days right after a long stressful business trips to rest and rejuvinate so they could keep up the pace in the long run.\nL9E1.  I advise my mentee to pay attention to their feelings and instincts when making decisions, and if something doesn't feel right to them, don't ignore their emotions.\nL9E2. I remind my mentee that with our workloads, it is impossible to get everything done in a day, and if they can honestly say they did as much as they could, they need to let go of feeling bad about it.\nL9E3. I advise my mentees to explore hobbies and interests outside of work so that they have some balance in their lives.\nL9E4. I advised my mentee, when they are struggling, to not worry about the noise and fodder around them and to just focus on what they need to get out of a rough patch.\nL8E1. When they aren't sure about taking a new route to get to an outcome, I tell my mentee that the first time they try they may not get there faster, but once they start the process and get comfortable with trying new things, they may learn that this new path is faster and/or better than the one they were originally given.\nK2C2.  When my mentee asked me my opinion about a new position they were thinking about, I helped to point out how it related to the different things I had observed about what they tend to like and dislike doing.",
      "L19E1. I advise them to think carefully about how much balance they need in life and how much pressure at work they are willing to accept.\nB19E1.  I advise my mentees to do enough research on their choices so that they would feel comfortable articulating and defending those choices with data and information.\nB19E2. I provided advice to my mentee about when to consider making a move if it appeared that the goals they were articulating to me were not matching up with the current path within the current organization.",
      "B13E1.  When my mentee would express a fear of failure I would tell them \"failure is never fatal; that's how you learn.\"",
      "L20E1. I advise my mentee to get additional perspectives besides mine when they are trying to develop new insights, so they can put multiple perspectives together.\nL20E2. I make sure when I provide advice to my mentee regarding decisions that I do not make the decisions for them but only provide some options or things for them to consider.\nL20E3. I speak honestly and directly when I give opinions and base them on their style and preferences and not my own.\nL20E4. I strongly encourage my mentee to ask more questions of me and others and probe until they get the answers that they need.",
      "B2E1. Encourage mentees to recognize and acknowledge others' direct and indirect contributions to his/her own successes to build team cohesiveness.\nB2E2. When my mentee receives news on an unfavorable decision, I would challenge him/her to approach the decision maker to politely ask for specific feedback on where the gaps were with his/her work to improve in the future.\nB2E3. Encourage my mentee to feel proud of his/her team's accomplishments and to speak highly to others of his/her teammates' work.\nB2E4. I provide a very specific and detailed piece of advice on what to try and why to try it as they are working to improve their written communication.\nL2E1. I advised my mentee to always present themselves in an ethical manner and to never embellish - they can proudly discuss their true accomplishments and value without needing to fabricate information.\nL2E2.  When others more junior to my mentee were working on a project with them, I encouraged them to begin delegating work to them and volunteering to help with their development to get experience with that sort of role to help get ready for a position down the road.  \nL2E3.  I advised them to do something I have learned to do: after writing a professional email that will have some weight or by which others may form an impression fo you, to save it and go back and read and edit later before sending it.\nL2E4.  I advised my mentee to really think about the contexts in which they will be presenting themselves, and to look into the formality of the environment so they can choose to present their appearance and clothing most appropritately for that context.\nL2E5.  I gently advised my mentee to pay very close attention to all the small details of their appearance in a professional environment and in their social media presence.\nL2E6.  Based on reviewing my mentee's background information, I looked for groups that my mentee could join for support and help with development, and offered to join them at the first meeting.\nL2E7. I tried to explain to my mentee that they sometimes projected an attitude that they were not aware of, and it may have impacted previous events in a negative way, so suggested they pay more attention to this in the future.\nL2E8.  I try at first to give some general direction and monitor how they work with the suggestion, and if its not quite what I had in mind or working properly, I become much more explicit with my advice for next steps.\nL2E9.  I advise my mentee that, although there are a lot of smart and experienced people around willing to help them work through a problem, that they should try to figure it out first on their own, exploring multiple avenues, but to know that in the end, there will always be someone to help if you really need it.\nL2E10. I stress to my mentee the importance of learning how to learn - how to figure things out for themsleves - and explain how much the tenacity required to keep pushing through a problem will help them in the long run.\nK2E1.  I looked for my mentee's weakest spot that I felt was holding them back in many situations, and pointed it out gently but clearly with specific advice on ways they could work to correct it.\nK2E2. I reviewed the performance feedback my mentee received from supervisors in a yearly evaluation and made some recommendations on how to process it with other previous feedback to come up with a prioritized developmental plan.\nK2E3.  I advised my mentee to think twice before sharing too much information about their personal problems with coworkers when they came to her with their own problems; they should shift the focus to the other person's needs to be most helpful.\nK1E3.  I emphasize the importance of clearly developing the message that my mentee wants to send to others and working on consistently conveying that message.\nL1H1. I share the steps of the process of creating a product including steps such as collecting and evaluating information and deriving a plan that they like and would  know how to defend to others.\nL8H1.  I walked the mentee through preparations for presenting before a crowd that was likely to be resistant, suggesting they talk about their message to all different types of people, not just friendly people, before going into the presentation, to be prepared for all different types of reactions they may encounter.\nK2C2.  When my mentee asked me my opinion about a new position they were thinking about, I helped to point out how it related to the different things I had observed about what they tend to like and dislike doing.\nB2C4.  I pointed out that even when working on a project where my mentee already had well-developed expertise, they could still use that experience to work on developing better skills in communicating within the organization.",
      "B11E1.  I suggested to my mentee that when they believed they were done with a project that before turning it in they should put it aside for a day and return to it with a critical eye.  \nB11E2 (same as B9E1).  I suggested to my mentee that when they had very techical questions that they are struggling with, they should not hesitate to go talk to individuals who have that expertise, and I am happy to help identify those experts for them.\nB11E3.  I reminded my mentee that they are paid to work for a certain number of hours per week, and so should think about how they could manage those hours to get as much out of them as possible.\nL11E1.  I tell my mentees to make sure to aim high, as they never know what they can fall into.\nL11E2.  I urged my mentee to talk to people before making changes in an approach so they could be prepared for what they would run into as a result of those changes.\nL11E4.  I suggest that my mentee think about all the ways their current job experience is developing them for different experiences they'll have in the future so that they can take better advantage of their current situation.\nB26E1. I suggest that my mentee monitor the time that things are actually taking as compared with the time we had allotted to a task, and when they were a quarter or half way through the time period, if they were not where they thought they should be, they should come to talk to me.\nB26E2.  I suggest that when my mentees plan their time, they think about their life as a whole and all their demands, interests, and priorities, as they are putting together a strategy.",
      "K16E1.  If my mentee seems stuck for solutions, I provide several, almost like a menu, with very specific steps and suggest any of the approaches could possibly work and why they might, but it is up to them to choose.\nL16E1. I made a suggestion about a small step that could be taken toward a larger life goal.",
      "",
      "L25E1.  I suggested that before making a presentation to a group on something that might cause unrest or discomfort, that the mentee have one on one conversations about the issue to try to \"pre-sell\" it to the members of the group.\nK25E1. I suggest that my mentee craft an improtant email that could be interpersonally sensitive in a word document ahead of time and spend some time getting it right before even putting it in the context of an email.",
      "",
      "L10E1.  I suggested that my mentee work carefully on becoming a careful observer of the world around them.\nK1E1.  I would encourage my mentee to say things or do things with their own signature style, so it becomes natural for them.\nK1E3.  I emphasize the importance of clearly developing the message that my mentee wants to send to others and working on consistently conveying that message.\nB2C4.  I pointed out that even when working on a project where my mentee already had well-developed expertise, they could still use that experience to work on developing better skills in communicating within the organization.",
      "",
      "",
      "",
      "L6E1.  I advised my mentee to increase their purposeful interactions with their peer group and others engaged in mentoring relationships to see what similar others are doing.\nL6E2.  I empathize with my mentee that it can be uncomfortable, but that they should think about how important it is to sell themselves to the organization they are interested in because they won't discover some things on their own unless they are open to sharing their unique qualities and assets directly.\nK8E1.  When my mentee is showcasing their work to others, I suggest they really highlight the diversity of what they can do well  because they never know quite what someone else is looking for.",
      "L21E1. I advise my mentees to get at least one or two other opinions besides mine as they are making a decision so they have multiple perspectives to draw upon, and I do this in a way that they know I won't be insulted if they choose something other than my opinion.\nB21E1. I encourage them to put extra time and effort into their important decision making, and not just what they will do but whether they have a sound and articulated reason for their choice.\nB21E2. I encourage my mentees to do enough research into their decision before finalizing it so they will clearly be able to defend their choice in an intelligent way.\nL21E2. Even after we spend a long time hashing out a decision, I suggest that my mentee sleep on it before finalizing it.",
      "B18E1.  When we're both not sure how the mentee should begin a project, I provide a bunch of scenarios to depict different ways they could start and assure them there is not just one right way to do it.",
      "K1E1.  I would encourage my mentee to say things or do things with their own signature style, so it becomes natural for them.\nK1E3.  I emphasize the importance of clearly developing the message that my mentee wants to send to others and working on consistently conveying that message.",
      "B14E1. I advised my mentee to view their life as a whole and consider their full spectrum of needs and the needs of their family when they make their future decisions.\nB14E2. I urged my mentee not to give up their non-work passions (like sports) and that we should consider how their ultimate career path would allow them to continue to pursue interests and passions.\nL14E1. When I've had a mentee come from another city I make sure to provide advice about restaurants, stores, dry cleaners, etc. so they don't have to start from square one to find all of the things that help keep life outside of working going smoothly.",
      "B5E1. Suggested that he/she create meaningful positive affirmations for him/herself that he/she would see every day.\nL5E1.  I advise them to find a nonprofit they care about and to donate a little bit of money to it, and then think about how great it will feel to eventually make more money to continue to give to that cause; they should then make a goal of how much they will give once they are in their next job making more money.\nB5H3. I took my mentee through my day in order for him/her to see first hand how business with clients is conducted.\nL5E3.  I advise them to assess their skill sets and their passion honestly, and if they have some measure of both for a certain activity, then they can take a reasonable risk to go for it.\nK1E1.  I would encourage my mentee to say things or do things with their own signature style, so it becomes natural for them.\nL5H1. We run through questions that my mentee plans to ask a new contact and how they plan to phrase things before their meeting.\nL8E1. When they aren't sure about taking a new route to get to an outcome, I tell them that the first time they try they may not get there faster, but once they start the process and get comfortable with trying new things, they may learn that this new path is faster and/or better than the one they were originally given.",
      "L24E1. I explained to my mentee that if they were to start more clearly demonstrating a high level of motivation so others could see it, opportunities they have not yet had would more likely start opening up to them.\nK8E1.  When my mentee is showcasing their work to others, I suggest they really highlight the diversity of what they can do well  because they never know quite what someone else is looking for.",
      "K12E1.  I tried to find the weakest spot my mentee had and suggested spending time on that in order to make their work more efficient.\nK12E2.  When a mentee is working on a product for me, I encourage them to give me notice if they get overwhelmed and need more time, rather than rushing through to produce a subpar product.\nL12E1.  I made some suggestions about how to communicate to people when they are agitated about a change they are making so that they will be more effective in getting their end result.\nL12E2.  I provided some suggestions for how to talk to a subordinate who is not living up to their potential.\nB12E2.  We discuss how they can handle inevitable resistance from particular people to changes in work they are planning to propose so they will be prepared when that conversation comes up.\nB12E3. I explain that there may be a fine line between explaining too much and not enough - the aim is to explain a product with enough so that they remember the important information.\nB12E4.  I emphasize that it is important not to overuse jargon in presenting a product to avoid both being confusing to the client and also sounding arrogant.\nB12E5. I suggest that when my mentee will be needing to sell a controversial idea, they consider \"pre-selling\" it in one on one conversations before the formal meeting.\nB12E6. I ask them to think about how they might have to modify their social style when talking about a product to different types of clients.",
      "L8E1. When they aren't sure about taking a new route to get to an outcome, I tell my mentee that the first time they try they may not get there faster, but once they start the process and get comfortable with trying new things, they may learn that this new path is faster and/or better than the one they were originally given.\nK8E1.  When my mentee is showcasing their work to others, I suggest they really highlight the diversity of what they can do well  because they never know quite what someone else is looking for.\nL8H1.  I walked the mentee through preparations for presenting before a crowd that was likely to be resistant, suggesting they talk about their message to all different types of people, not just friendly people, before going into the presentation, to be prepared for all different types of reactions they may encounter.",
      "B7E1.  I shared with my mentee what he/she would expect out of others if he/she were to behave passively, and how much more he/she could expect if he/she demonstrated assertiveness in showing what he/she does and can do.\nB7E2. I shared my advice for how corportate America tends to work and some ways to navigate politics to work through the system up or laterally.\nB7E3.  When my mentee states goals that seem too long-term, I acknowledge the importance of that goal, but encourage the setting of short-term goals along the way by helping them break it down into a shorter time frame.\nK7E1. I told my mentee that because they are so entrepreneurial they may enjoy a smaller company environmnet better than a large corporation.\nB7E4. I told my mentee to think about both their short and long term goals, and that their long term goals should influence their short term behaviors.\nB7E5. I suggested that before they look for another job they consider if it would be wiser to stay and get a few more years of experience so opportunities for bigger and better jobs would open up.\nB7E8. Although I know the organization would not be happy that I am advising my mentee to leave, as a mentor I knew it was the right move and I advised them to take it.\nL22E1. I explain to the mentee why it is so important to learn a lot about the company where they interview and express their interest in them openly and pay attention to their own body language - they want to make sure the interviewer knows that the organization is desired.\nK8E1.  When my mentee is showcasing their work to others, I suggest they really highlight the diversity of what they can do well  because they never know quite what someone else is looking for."
    ],
    [
      "",
      "",
      "",
      "",
      "B2H1. I walked him/her through the major steps of how to implement a change:  get buy-in from leadership, present the idea to the right people, work with those people on implementation, measure results, and follow up.\nB2H2. Following feedback that a mentee didn't grasp how to do something properly, I took them into a private spot and explained it differently and then we practiced it together until there was a full understanding.\nB2H3. When we target the mentee's resume for a new opportunity, we walk through the steps together, but I have them take ownership of starting writing narratives of how each of their positions are relevant to this new position, and then we may make the wording more dynamic together\nL2H1.  When my mentee is confronted with a new problem or task, rather than just providing advice on what I would do, I suggest we explore it carefully together and work it out, like a partnership of dual discovery.\nL2H2. We clearly name the problem we are trying to tackle, and then sit down together and ask all the questions we can think of concerning what needs to be done to complete the challenge successfully, and make sure we have a written, detailed outline.\nL2H3.  I thought of ways to best simulate an experience my mentee was going to have, and we went to the most similar place I could find and I played the role of the other person they would be meeting with right from the start in order for them to walk through their planned meeting the most authentic way possible.\nK2H1. We walked step by step through how my mentee had behaved in a past situation, using really clear and detailed and explicit language, and compared it to how the organization expected them to behave in that situation.\nL2H1.  I let them know they should go into any situation meeting new people with two or three questions prepared, and then we walked through the types of questions that would make sense and they practiced with me.\nL8H1.  I walked the mentee through preparations for presenting before a crowd that was likely to be resistant, suggesting they talk about their message to all different types of people, not just friendly people, before going into the presentation, to be prepared for all different types of reactions they may encounter.",
      "K11H1.  We walked through the specific steps that my mentee could take the following week at work that could help them try approaching something in a different way.\nK11H2. We sat down together and wrote down exactly what they need to do step by step to complete a project.\nK11H3.  When my mentee made a suggestion about a course of action, I reinforced that the idea was good but encouraged them to talk through the steps they would take to complete that action.\nL11H1.  We sat down and walked through the process step by step to see where money was going and where they could cut expenses to make debt reduction a more efficient but tolerable process.\nL11H2. When my mentee was trying to organize a big meeting we walked through each of the agenda items step by step and made sure notes on what they would say were clearly thought out and organized.\nB11P1.  I provide training to my mentees in the processes of goal setting and work them through the differences between long and short term goals and how to create short term ones from long term ones.\nB11P2.  I showed my mentee the technique of using a decision matrix rather than a simple pro and con list, which involves the pros and cons of one decision vs. that of another, and stressed how important it was to be completely honest and thorough in order for it to be useful.\nB11P3.  I taught my mentee how to do a profitability analysis for their project before they jumped into anything.\nL11P1.  I went through different problem-solving steps and explained how to go about finding appropriate information in order to reach a goal.",
      "B16H1.  We practiced the exact steps that the mentee would take to pitch an idea to a client so they could experience what all the steps would feel like ahead of tiem.\nB16H2.  We walked through all of the things they should do to prepare for an open discussion with their manager before they approached them so they felt calm and prepared.\nL1H1. I share the steps of the process of creating a product including steps such as collecting and evaluating information and deriving a plan that they like and would  know how to defend to others.",
      "",
      "",
      "",
      "",
      "",
      "L3AB1. I convince my mentee that I see their success as my success too and I will share in the responsibilities and the joy of their success.",
      "",
      "B6H1.  I walked through a practice conversation with my mentee's manager so that the mentee understood how to best structure the discussion and present ideas and requests.\nL6H1.  I walked through all the steps to tracking contacts in a spreadsheet, from contacting everyone regularly with relevant updates of activities, tracking all times contacted and for what reason, to writing thank you notes.\nB6P1. I provide some training in the networking process and speaking to others proactively and demonstrating clearly what the mentee can do that could be helpful to them.",
      "",
      "K18H1. We got out one sheet of paper and I had the mentee write down their thoughts on one side of the paper as simply as possible so we could work from that to create a plan.\nK18H2. I write down in a clear list format the exact needs of a project and the steps the mentee would need to accomplish.\nB18H1. I prioritized some steps for the mentee to use to help prioritize the order of things when they are overwhelemed with projects.\nB18H2. When my mentee was unsure how to begin a new task I explained line by line how everything had been done and why.\nB18H3. I explained some simple ways to check their work so that they wouldn't get stuck starting out of fear of doing it wrong.\nL18H1. When my mentee was stuck trying to figure out who could be the best list of references for them, we talked through how well they knew each person and whether they knew them in a context where they'd be able to provide the information needed and in the most positive way.",
      "L1H1. I share the steps of the process of creating a product including steps such as collecting and evaluating information and deriving a plan that they like and would  know how to defend to others.\nL8P2. I coach them through very specific steps as they learn a new process and make sure they write down everything.",
      "",
      "B5H1. I walked through a work procedure with the mentee and provided some notes on how to approach the task the next time he/she tried it on his/her own.\nB5H2. I set up a role play for an upcoming presentation that he/she had in such a way that the environment was simulated as best I could and I played a role of a difficult person he/she would likely encounter.\nL5AB3.  I convinced her that it wasn't a sign of weakness to take into account parts of her life that she highly valued when making a work-related decision.\nB5H4. Using a series of questions, I walked him/her through the process of figuring out what he/she most wanted to do, how much he/she could currently do in that area, what skills he/she still needed to develop, and how we could get there to create a clear roadmap for him/her.\nB5H5.I walk my mentee through the steps of gathering data from experienced people in the field to have an accurate picture on paper of the scop eof a task.\nK5AB1. I convince my mentee that they are in a good place having made the choices that they had to get where they are.\nL5H2.  I conduct a mock job interview with my mentee using resources I've gathered to make it as realistic as possible to help my mentee know what to expect.\nB5H6.  We walk through each step of the mentee's thought process from beginning to end, and then we go back and dig in and discuss each one.\nB5H7.  When my mentee has a big meeting coming up, I ask them to clearly state what they hope to get out of it, and then we role play it and review.\nK5P1.  I have my mentee do a dry run through a new task completely on their own as I watch and then I provide constructive feedback.\nB5P1.We role played through an upcoming event making the situation as realistic as possible (e.g. going out of the normal meeting place to one that would be more similar to the event).",
      "",
      "K12H1.  We opened up the final product my mentee wanted me to review and we walked through all the parts and I had her explain the why she chose to do each part the way she did.\nK12H2.  We walked through all the specific things my mentee could remember working with a team on and broke down the specific process that occurred to get to the end product.\nK12P1.  I made improvements to a work product my mentee did and then explained the reasoning behind each change and how they could do it on their own next time.\nK12P2.  I had my mentee shadow me throughout the course of the day to pick up on some of the nuances of the way I do things.\nL12P2. When they didn't have much experience with a software program that would be helpful in getting their job done, I provided some training in how to use it for the purposes they needed.\nL12P3. I tutor my mentee in parts of business plan development that they struggle with.\nL12P4. When my mentee wanted to learn to write better, I used some of their basic writing and showed them specific techniques for changing nouns and verbs to make their points more effective.\nB12P1.  If my mentee is working hard to understand the the technical aspects of a task I will take time to train them on the specifics of exactly what is done in what order at what times and why.\nB12P3. I train my mentee to wait a day if possible once a project is done before they turn it in, and then how to conduct a critical review of their own work with fresh eyes before its too late.",
      "L8H1.  I walked the mentee through preparations for presenting before a crowd that was likely to be resistant, suggesting they talk about their message to all different types of people, not just friendly people, before going into the presentation, to be prepared for all different types of reactions they may encounter.\nL8P1. I provide training to my mentee across a range of skills so that they could easily adapt to a variety of situations.\nL8P2. I coach them through very specific steps as they learn a new process and make sure they write down everything.",
      "L22H2. I practice interview questions with my mentee patiently over and over until they are so comfortable with anything I pose to them and I know they are ready."
    ],
    [
      "K9AB1.  I persuaded my mentee to keep pushing themselves until they got to the point of nervousness, and then convinced them that that feeling was indicative of taking a big step and so it was a good thing.\nK9AB2. I convinced my mentee that we had to start pushing harder because we've already done so much together and we had to continue to push the needle.",
      "",
      "",
      "",
      "L2AB1.  When  my mentee was asked to take on a big challenge with a lot of responsibility that they hesitated accepting, I convinced them if they did this it would pay off and get them where they wanted to be.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "B21AB1. When they are on the fence about a decision that seems sound but they are hesitant I try to persuade them of some specific reasons they should go for it, such as it being backed by their passion, drive, or unique skills.\nL21AB1. I persuaded my mentee that it wasn't a sign of weakness to take into serious consideration non-work factors that were important to them when making decisions.\nL21AB2. When they really want to do something unconventional but seems right for them, I encourage their creativity and unconventional approach.",
      "L18AB1.  I persuade my mentee to take on a new project by telling this \"if this is your ultimate objective, you are going to nail this objective once you do this task.\"\nL18AB2.  I convince my mentee to start a new project by helping them to realize that if they do it they will be way ahead of their peers.",
      "",
      "",
      "L5AB1.  I convince them that they need to find their own voice and own way of expressing themselves and doing their work that is authentic to them.\nL5AB2. I enhance their drive to keep pushing through tough challenges by convincing them of what they payoff will be if they don't give up.\nL5AB4.  I persuaded my mentee to trust themselves and to purse what was making them the most excited, even if it seemed scary.\nL5AB5. Early on I planted the seed that they do not have to be in the career rut they think they are stuck in and that it is up to them to work their way out.  \nK5AB2.  I persuaded my mentee that although there are a lot of opportunities in their organization, they have to be pursued - the opportunities won't come to them, they have to pursue them and they have what it takes to do that.\nK5AB3.  When a change was really right for my mentee but they hesitated out of lack of confidence, I convinced them to listen to their gut and mine and to follow their passion.",
      "",
      "",
      "",
      ""
    ],
    [
      "K1F6.  I look for what my mentee struggles with most and give them a direct assignment to make a step in that direction before we meet again, acknowledging that it might be challenging to them.",
      "L19F1. After my mentee has provided a list of jobs that sound interesting to persue, I ask them to articulate specifically what is interesting to them about the jobs and then put them in a rank order to help understand their priorities.\nK1F1. I give my mentees a starter list of companies that might be good to work for, and then require them to add significantly to that list and come back with a list of specific jobs they may be interested in for us to discuss.\nK1F4. I instruct my mentee to call a person that I know in a field they are interested in to do an informational interview to learn more specifically about what the job entails day to day.\nL1F3.  When I ask my mentee to research a resource or organization that could help with their development, I ask them to come prepared to tell me how they think it will or will not help them or fit with their goals.\nL1F5. I require that my mentee come prepared with a pristine resume and a clear idea of their career path so I can be prepared to figure out how to use my insights and connections to help them get where they need to go.",
      "K1F6.  I look for what my mentee struggles with most and give them a direct assignment to make a step in that direction before we meet again, acknowledging that it might be challenging to them.",
      "",
      "K2F1.  In order to help develop my mentee's powers of observation of detail, I ask them to take a notebook and go somewhere to observe the details and then we discussed what they noticed and how it could inspire them.\nL2F1. I monitor their workload such that I give them incremental assignments that are challenging but achievable given their other demands.\nL2F2. I create incremental presentation assignments such that they start out with straightforward content just presenting with me, then the same content with a larger group, then more abstract content in front of a larger group, and so on such that each experience is progressively more challenging but builds on their last success.\nL2F3. Once I saw what my mentee could do, I added them to significant roles on my own projects.\nL2F4.  I explained to my mentee that I was assigning them the task of developing training in a particular area because developing and executing training is one of the best ways to learn something yourself, and the added advantage is having a product at the end that could be leveraged to their advantage and help the organization.\nL2F5. I provided the general parameters and framework of an assignment and what I was hoping could come out of it, and let my mentee use their expertise to do the rest.\nK2F2. I assigned my mentee the task of starting a contact spreadsheet before we met next.\nK2F3.  I had my mentee pick a couple of subjects on the agenda of an upcoming meeting and prepare notes and questions so they would feel more comfortable contributing at the meeting.\nL1F3.  When I ask my mentee to research a resource or organization that could help with their development, I ask them to come prepared to tell me how they think it will or will not help them or fit with their goals.\nL1F4. If my mentee was speculating about a project, I instructed them to determine the best expert to ask about its feasibility, and then come back and tell me what advice they received and how they incorporated it into their planning.\nL1F7.  I instruct my my mentee to develop a clear and complete list of detailed questions to ask when following up for a potential role or opportunity in order to be as competitive as possible.\nB2C2. I  place my mentee in roles and assignments that provide them with what they most want and need to learn and understand.",
      "L11F1. I assigned my mentee the task of researching a similar business startup to what they were interested in and to look at the history of their growth and decisions so we could talk about that and see how it could help us.\nL11F2. I give my mentee a small but doable assignment each time we meet so they will always feel a sense of accomplishment when they come to meet with me.\nB11F1. I send a recap email after each meeting that has two bullets, one reminding what we talked about and one with a specific assignment on what to do to work on these things before we meet again.\nK11F1. I have my mentee create an action-planning document that has their goals and as they plan their activities for the month - classes, lunches, etc - they are to write them down under the relevant goal they help achieve, and also include a statement about what they expect they will get out of each of these activities.\nL26F1. I gave my mentee the assignment to log everything they do and how long it takes over the course of a week so we could review the data together and assess their time management strengths and weaknesses and develop a plan.",
      "",
      "K27F1. I request that my mentee come up with a list to share with me of the four or five things that are most important for us to discuss in mentoring.\nK27F2.  I ask my mentee to come up with a series of questions for me as if they were the mentor and I was asking them for next steps, so that we can use those same quesitons with them.\nK1F8.  I ask my mentees to tell me the top three things they need from me to prepare me for our next meeing, acknowledging that I need coaching from them on how to be the best mentor to them.",
      "",
      "",
      "L10F1.  I provided as many assignments that were in my control that I could to get them the experience that they needed.\nL10F2.  When I give assignments, I give them in a very gradual and systematic way so they build on the others but will not overwhelm them.\nL10F3.  When building a series of assignments to give them more expertise in public speaking, I started with a one-on-one assignment with me, then the same talk in front of a group, then one with more abstract content in front of a larger group, etc., to build the challenge progressively in multiple ways.\nL10F4.  I had my mentee develop some training in an area they were trying to develop their own expertise, because that is one of the best ways to really get to understand something well and they'd be able to leverage the experience in the future.\nL10F5.  I let my mentee know when they had more skills than I did in a particular area and I gave them the opportunity to work on an assignment using those skills and explain the process to me.\nL10F7.  I gave my mentee a notebook and the assignment to go to a public place and observe and take notes of everything around them.",
      "L15F1. I give my mentee an assignment that is a bit vague to see what they do with it to get a sense of their work style and level of talent in a particular area.\nK1F5. If I am not understanding what my mentee exactly wants to do and feeling at a loss for advice, I give an assignment for them to think more carefully and provide a more detailed description of their needs or plan of action the next time we meet.",
      "K1F8.  I ask my mentees to tell me the top three things they need from me to prepare me for our next meeing, acknowledging that I need coaching from them on how to be the best mentor to them.\nK1F8.  I ask my mentees to tell me the top three things they need from me to prepare me for our next meeing, acknowledging that I need coaching from them on how to be the best mentor to them.\nL1F6. I suggest that my mentee start asking me some probing question about my own next steps, to help them think about the types of questions they can ask themselves.",
      "L23F1. I request that my mentee always ask me probing questions when they arise and not to hesitate to do that, that I welcome them.\nK1F8.  I ask my mentees to tell me the top three things they need from me to prepare me for our next meeing, acknowledging that I need coaching from them on how to be the best mentor to them.\nL1F6. I suggest that my mentee start asking me some probing question about my own next steps, to help them think about the types of questions they can ask themselves.",
      "L6F1.  I ask them to organize their contact list in a format they find easy to manage and track, and then share it and explain who is on it.\nL6F2.  I asked my mentee to think about who on a contact list could provide the most valuable information and to talk to that person before we next met.\nK6F1.  I invited my mentee to an off-site visit that would be attended by key people to send a signal to those folks that my mentee was someone to watch for.\nB6F1.  I requested that the next time my mentee was in a meeting where they were asking for volunteers to answer questions that they be the first to raise a hand, so to increase their visibility to others.\nK1F4. I instruct my mentee to call a person that I know in a field they are interested in to do an informational interview to learn more specifically about what the job entails day to day.\nK1F2.  I require my mentees to start or develop a detailed contact list of their network and a system for tracking it.",
      "L21F1. I require my mentees to take time on their own to make a very clear pros and cons matrix regarding their decision that we can talk about in the next meeting before they act on the decision.",
      "L18F1.  I ask my mentee to come to the next meeting with a detailed written plan about specifically how they plan to turn a new idea into reality.",
      "K1F1. I give my mentees a starter list of companies that might be good to work for, and then require them to add significantly to that list and come back with a list of specific jobs they may be interested in for us to discuss.\nK1F2.  I require my mentees to start or develop a detailed contact list of their network and a system for tracking it.\nK1F4. I instruct my mentee to call a person that I know in a field they are interested in to do an informational interview to learn more specifically about what the job entails day to day.\nK1F5. If I am not understanding what my mentee exactly wants to do and feeling at a loss for advice, I give an assignment for them to think more carefully and provide a more detailed description of their needs or plan of action the next time we meet.\nK1F6.  I look for what my mentee struggles with most and give them a direct assignment to make a step in that direction before we meet again, acknowledging that it might be challenging to them.\nK1F7.  I give my mentee homework to find three people to have a conversation with about what the mentee is currently working on and most proud of, and to return and tell me about how these conversations went.\nK1F8.  I ask my mentees to tell me the top three things they need from me to prepare me for our next meeing, acknowledging that I need coaching from them on how to be the best mentor to them.\nL1F1.  I determine how many tasks my mentee could reasonably get done, with deliverables, by the next time we meet and give them a list showing confidence I know they can complete them.\nL1F2.  I tell my mentee to complete assignments ahead of meeting times so I can be as prepared as possible in reviewing it with them.\nL1F3.  When I ask my mentee to research a resource or organization that could help with their development, I ask them to come prepared to tell me how they think it will or will not help them or fit with their goals.\nL1F4. If my mentee was speculating about a project, I instructed them to determine the best expert to ask about its feasibility, and then come back and tell me what advice they received and how they incorporated it into their planning.\nL1F5. I require that my mentee come prepared with a pristine resume and a clear idea of their career path so I can be prepared to figure out how to use my insights and connections to help them get where they need to go.\nL1F6. I suggest that my mentee start asking me some probing question about my own next steps, to help them think about the types of questions they can ask themselves.\nL1F7.  I instruct my my mentee to develop a clear and complete list of detailed questions to ask when following up for a potential role or opportunity in order to be as competitive as possible.\nL1F8.  I insure the mentee that I am monitoring what else they have going on at a particular time so that I'm requesting deliverables only when I think they are doable, and in exchange I expect accountability on turning in assignments on time.",
      "L14F1. When my mentees do not have professionals lined up that they could need suddenly in life - doctor, lawyer, accountant, etc. - I request that they go find a recommendation of a name and number in each category that they keep with them in case of emergency.",
      "L5F1.  I assigned my mentee to create positive affirmations and messages that resonate personally with them and put them somewhere where they will see them on a daily basis to help build their confidence.\nL5F2.  I instructed my mentee to seek out the positive people in their life and make an effort to spend more time with them and less time with the people that bring them negative energy.\nK1F6.  I look for what my mentee struggles with most and give them a direct assignment to make a step in that direction before we meet again, acknowledging that it might be challenging to them.\nK1F7.  I give my mentee homework to find three people to have a conversation with about what the mentee is currently working on and most proud of, and to return and tell me about how these conversations went.\nL1F1.  I determine how many tasks my mentee could reasonably get done, with deliverables, by the next time we meet and give them a list showing confidence I know they can complete them.",
      "",
      "L12F1.  I asked my mentee to do an exercise where they follow my directions about how to approach a task exactly, and then we have a follow up conversation about how it went and what they learned from it.\nL12F2. I sent my mentee out to make some observations of a situation to bring back to me at a later meeting in order for us to discuss how to use it.\nL12F4. I make sure my mentees have and are properly using their social media accounts (like Linkedin and Facebook) to research people with whom they will be interacting.",
      "B8F1. I create environments to enhance the nimbleness  of my mentee by giving them assignments without warning and with very short time frames to give them the opportunity to think on their feet. I provide some assistance and support through the assignment, but require them to figure out their course of action.",
      "B7F1. I helped to put him/her into assignments around the company to get a broader range of experience so he/she wouldn't build too specific a skill set.\nB7F2. When I believe that their goals seem unrealistic, I have them spend more time doing research and thinking about how achievable they are, and then have them come back to me, sit down and look me in the eye and tell me they still believe they can reach those expectations.\nL7F1.  After coming up with a list of potential companies they are interested in working for in the future, I ask them to rank order them and articulate in writing specifically why they are interested in them.  \nL1F7.  I instruct my my mentee to develop a clear and complete list of detailed questions to ask when following up for a potential role or opportunity in order to be as competitive as possible."
    ],
    [
      "L9G1. I got my mentee to laugh a little with me after they experienced a failure and reminded them that getting beat up once in a while means they are making a change and making things happen.\nL8AG1. As my mentee is trying new things I make sure that they know that there will not be negative ramifications with me if they fail, and that they are likely to fail if they are really trying to push themselves.",
      "",
      "B13AG1.  I make sure they understand that I really believe that you have to fail sometimes to learn and that failure is not fatal and something to be ashamed of.\nL8AG1. As my mentee is trying new things I make sure that they know that there will not be negative ramifications with me if they fail, and that they are likely to fail if they are really trying to push themselves.",
      "L20AG1.  When my mentee is set on trying something I don't think will work well for them and they resist my advice, I support them in trying it out as long as it is not something that will harm them, and then follow up and have a conversation about what they learned by giving it a try and why I had originally advised against it.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "L8AG1. As my mentee is trying new things I make sure that they know that there will not be negative ramifications with me if they fail, and that they are likely to fail if they are really trying to push themselves.",
      ""
    ],
    [
      "",
      "",
      "",
      "",
      "L2AJ1.  I take my mentee around with me and have them watch me interact with others to see how I go about conducting business.\nL2AJ2. I consciously model work-life balance behaviors where I can and point out the strategies I take to maintain this balance so they can see it is something that is possible in our field.\nL2V1. I share wisdom I have learned along the way whenever I think it is relevant to a competency they are trying to develop.\nL2V3.  I share stories where I can laugh at some of the blunders that I made along the way while trying to learn things so they can see it's ok to laugh at yourself and making mistakes is part of learning.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "K3I1. I provided financial resources for my mentee to attend classes that they couldn't otherwise afford.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "L8D1.  I use examples from our own effective communication that I've modeled in our relationship to help demonstrate how to tailor communications with different types of people my mentee will encounter.",
      ""
    ],
    [
      "K9I1.  I recommended a website that sends gratitude daily emails that I thought might be something my mentee would find helpful when they start their day.",
      "",
      "",
      "L20I1. I suggest some books and websites they can use to assess their interests and learn more about different paths that fit them.\nL20I2. I provide some books and periodicals for them to read that we can talk about in our meetings in terms of how it will be applicable to what they are working on.\nK28I1.  Together my mentee and I sat down and looked lon line for seminar opportunties that would be most helpful for the areas se most wants to learn more about.\nK28I2. When I come across a seminar or developmental opportunity, I email my mentee and ask them if they've already signed up in a way that assumes that they already did proactively register and I'm jut making sure they saw it.\nK28I3. I keep a look out for books that will be of particular interest to my mentees and provide their exact reference whenever I can.\nK28I4. If I own a book I know will be a valuable resource, I loan it to my mentee and then I ask them to articulate to me after reading what they thought of it and specifically how it could be helpful to their learning needs.\nK28I5. I printed out a one-page sheet on pointers for public speaking as a short go-to reference for my mentee (**note I might have this somewhere else already in different form)\nK28I6. I keep a tool kit of reference articles available during my mentoring meetings so I can pull out any that might be relevant to what we are working on together that day.",
      "L2I1. I provided my mentee with a \"cheat sheet\" developed by professional public speaking trainers to review before a speaking engagement.\nL2I2.   I emailed my mentee some links to reference materials that I think will be helpful to reaching their goals.  \nL2I3.  I loan my mentee books that I find to be exceptional resources and ask them to articulate back to me the message they get back.\nL2I5.  I keep a tool kit of articles I've gathered over time that I know will be helpful to mentees learning how to network.\nL2I6. When my mentees struggle with articulating their strengths and weaknesses, I provide a handout that aids in this type of self-reflection.",
      "B11I1. I have provided templates of resumes to help get my mentee started on developing or upgrading their own.\nL11I1.  I provided a template of a job search spreadsheet and also pointed to sources on the internet for other formats, so they could find one that would help them track their job search in an efficient manner.\nL11I2.  When my mentee was really pressed for time on some research that needed to be done, I helped find some links to get them started.",
      "",
      "",
      "",
      "",
      "",
      "",
      "L4I1. If my mentee is lacking in financial resources I will sometimes help pay for things they need within reason, such as fees for a developmental opportunity.",
      "",
      "L6I1.  I provided my extensive contact list to my mentee to review to see who might be of help and who they may have direct or indirect connections with by various degrees of separation.",
      "B21I1. I provided a few web links for information that I thought would help my mentee get started with their decision.",
      "L18I1.  I provide my mentee a long list of companies that they can start researching as they begin a job search project.\nL18I2.  When my mentee hesitated starting a job search because there are 'no jobs out there' I did some research and came up with a written list to provide them that included several jobs they were qualified for so they could see that there indeed were jobs out there.",
      "",
      "",
      "",
      "",
      "K12I1.  I provide my mentees with an easy to follow template for creating and improving a resume.\nL12I1.  I try to provide the tools and resources that I think will be most helpful for them to achieve success in their first year at the firm.\nL12I2.  When I see reference material online that relates to things we've been working on, I forward them to my mentee.\nL12I3. I lend my mentee my favorite resource books that have been helpful to me and will not be an overwhelming time commitment.",
      "L8I1. In planning the stretch assignments that I give to my mentee where they will have to re-invent themselves and be adaptable, I make sure I have the time to support them and the resources available to them that they will need so that the assignment, even when it requires them to stretch and think and act differently, will be achievable.",
      "L7I1. I provide my mentee with written guidelines on negotiation that has very specific information on possible contingencies so they are prepared.\nL22I1. I provided my mentee a list of very specific questions to ask during an interview (e.g., about developmental opportunities, team structure, etc.) and then we worked together to add to the list.\nL22I2. I gave my mentee a large list of regional and international companies and asked them to choose a number of companies from each and research them, and return with a smaller list that they would like to pursue a job search within. (**Note I may have done one like this before, and it may be in 'give assignment' somewhere.)"
    ],
    [
      "",
      "B19J1.  I offered to connect my mentee to a senior leader in the area that the mentee was most interested in learning more about as a potential career direction.",
      "",
      "L20J1. I introduce my mentee to people who I think can provide them with expertise or information that I don't have.\nL20J2. I make an initial introduction to the people I know whom I think can help them so that they will feel more comfortable seeking them out when needed.",
      "B2J1. Actively sought out projects with other departments and/or people to give the mentee the opportunity to grow in many different areas and have exposure to other workstyles and people.  \nB2J2.  I let my mentee know that at our organization the opportunities were vast but in order to seize them they had to proactively reach out to others and find those opportunities.\nB2J3.  I offered to give them exposure to a senior leader that I knew who was in the area they wished to eventually pursue.\nB2J4. I helped to place they best fit but that would also give them to other functions that could be of interest.\nB2J5. I communicated that I would be able to provide a lot of exposure to my specific area of expertise, but I would like to help assist him/her to spend time in other areas to get more exposure to those types of jobs.\nL2J1.  Before connecting my mentee with people who may help their network, I make sure those are the types of people that will be open to hearing from them and will be encouraging, and then I let the mentee develop those relationships proactively without too much hand holding from me.\nB2J6.  When connecting my mentee to others via email, I specifically explain in an email to both of them why I am introducing them to each other and how I think it would benefit both of them to connect.\nB2J7.  Whenever my mentee and I were having some challenges and feeling stuck on something, I would reach out to someone else with expertise via email and ask for their assistance, explaining how it would help us create the most maximally useful project for the organization.\nL2J2. I looked for special project teams being formed and let the organizers specifically know what was special about the way my mentee thought about issues and how they would be a great addition to the project.\nL2J3. When connecting my mentee to someone I know who I think could help them, I send an email to them both introducing them to each other and saying something specific about how I know each of them, something about each of them, and specifically how I think the connection could be beneficial.\nL2J4. I found a person that I knew would really be able to help a mentee going forward, and emphasized how much potential my mentee had with enthusiasm, and then followed up regularly to make sure my mentee was still on their radar.\nL2J5. I considered what friends I had in other departments whom  could contact to get more experiences in other fields and contacted each of them and requested that as relevant projects came up, my mentee would get considered for these experiences that would help them decide what they wanted to do next.\nL2J6. I will ask around my contact list to see if I can find a contact of a contact in a particular company, and then I will call and stress how interested my mentee is in their company and request that they provide them with just an informational interview to get  a foot in the door.\nL2J7. When I knew I'd be going on a vacation and my mentee would have some time on their own, I contacted someone I knew in another organization and asked if they had any research projects being managed by very experienced individuals that my mentee could help with to gain specific experiences while I was gone.\nL2J8.  When I have intentions to ultimately connect my mentee to someone I know only casually, I work a bit on building my own relationship with that person to develop trust and mutual liking and respect before making the connection request.\nL2J9. I encouraged a contact in the company to ask around and learn more about my mentee and their reputation before we planned how we together could find my mentee the opportunity to develop that he was requesting.\nB2J8.  During a time I knew I'd be on vacation, I called a contact to see if my mentee could work with them or one of their employees while I was gone on some things that would help build the mentee's experiences in a new area while I was away and help them out as well.",
      "K11J1. I let my mentee know I could help get the ball rolling by introducing them to some people but they'd need to take it from there.\nK",
      "",
      "",
      "",
      "",
      "",
      "",
      "K4AC1.  When my mentee is having some difficulty with a person I know I have a calm conversation with the other person to help them understand my mentee a bit more.",
      "",
      "B6J1. I had contacts in the place where my mentee was going to be moving, and I reached out to them to ask them to help facilitate my mentee's new role.\nB6J2.  I pointed out individual(s) who I worked with who could be good resources for my mentee's specific questions\nB6J3.  I would offer to make an introduction to a person I knew who I thought could be of significant help to my mentee.\nB6J4. I introduced my mentee to my own mentor and encourged my mentor to also introduce my mentee to other leaders in our company.\nL6J5. I shared info with a colleague on how much potential my mentee had and got that person on board to help me keep an eye out for opportunities for my mentee that I might not spot myself.",
      "",
      "B18J1.  I introduced my mentee to someone who had technical experience beyond their own for a project they were starting to help them so they didn't have to spin their wheels trying to figure out the tech side on their own.",
      "",
      "",
      "",
      "**note: some of the other things in connect to others that appear in other objectives would fit in create opportunities too, and perhaps in promote mentee column as well, so when moving things around, pay attention to that.",
      "",
      "",
      "B7J1. I contacted a leader in the group that had a need that best fit my mentee's interest when that leader's need was high to maximize my mentee's chances of a long-term opportunity with that group.\nB7J2. I look for chances to champion my mentee whenever an opportunity comes up for me to provide their qualifications to try to get them an assignment that would benefit them. \nL7J1. I will ask around my contact list to see if I can find a contact of a contact in a particular company, and then I will call and stress how interested my mentee is in their company and request that they provide them with just an informational interview to get  a foot in the door."
    ],
    [
      "K9AC1.  When my mentee needed someone to intervene in a situation on their behalf, I asked what information would be acceptable to share with the other party and whether they wanted to be included in the conversation.\nK9AC2.  When I was in a mentoring relationship where it was prearranged that I discuss progress with the mentee's supervisor, I made sure the mentee knew exactly what to expect so their would be no secrets or surprises.\nK9AC3.  I encourage my mentee to share their needs with their manager, but also ask if it would be helpful if I intervene as well, with their permission.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "L17AC1. When I knew someone wanted to get my mentee involved in an assignment I thought would derail them, I intervened and said they were too busy.",
      "",
      "",
      "B4AC1. If the situation arises where my mentee might be struggling in a conversation with others while I am there I try to step in and back them up in a supportive way without belittling them or embarrassing them, but rather helping to save them from embarrassment if they are heading in that direction.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    [
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "B6AO1.  I spoke so highly of my mentee to my own mentor whenever I had the opportunity, and thus that mentor became accessible to my mentee as well.",
      "",
      "",
      "",
      "",
      "",
      "L24AO1.  I reach out to my contacts in the area my mentee most wants to end up in the long run and discuss my mentee's passion for that field and ask for any opportunities for the mentee to talk with and learn from them.\nL24AO2. Before my mentee approached one of their superiors with some concerns and ideas, I went to that person and explained the mentee's good intentions and asked if they could be open minded to listening to the mentee's pitch.",
      "",
      "",
      "B7AO1. Any time I spotted an opportunity that aligned with my mentee's interests I would become their champion and highlight how they would fit the opportinity in an enthusiastic way."
    ],
    [
      "",
      "B19AA1.  I actively sought out projects in other departments that would help give my mentee experiences that could help them clarify their career goals.\nB19AA2. I informed my mentee of a lot of opportunities available in their current company and encouraged them to be proactive to seek them out for further experience.",
      "",
      "",
      "B2AA1.  I told my mentee about seminars directly related to what they were wanting to learn more about and we reviewed them and together decided on the best to take for their goals.\nB2AA2. When I needed help on a project and was able to take someone on, I passed it to my mentee so that I could facilitate their development in a day-to-day manner.\nB2AA2. I created a list of developmental opportunities that often come up in my mentee's role that they hadn't yet taken advantage of to help remind them and stress the importance of these in order to develop and demonstrate that development to others.\nB2AA4. I sought out the most appropriate person I could find for my mentee to job shadow for a day that would be able to provide a model for some things my mentee hopes to be able to do.\nB2AA5.  I researched opportunities for my mentee to get broad exposure to all the different aspects of their field to give them a good general understanding of the full gamut of duties.",
      "",
      "",
      "",
      "",
      "L17AA1. I looked out for work opportunities for my mentee's life partner in the same geographical region my mentee planned to be to help remove one of the stressors involved in the decision to pursue their opportunity.",
      "B10AA1.  I made my mentee aware of presentation opportunities that gradually moved them to more and more challenging situations I that they affected more people and were more abstract.\nL10AA1.  I got my mentee invited to a meeting of an organization they wanted to join so they could determine if it would be helpful to their expertise development.",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "B7AA1. When I know someone in the organization that I know will help me promote and groom my mentee for the future, I look for opportunities to get them together so that person can see for themselves why they should take them on.\nB7AA2. I look for and pass on any opportunities where they can get broader experience within the organization and explain to them why they should grab these opportunities whenever they can.\n**just a note - would job shadow (like in B7C5) go here too? Right now in assess needs.  Flagging for later when we move things to multiple places\nB7AA3.  I worked with my mentee to plan how we would move them in very gradual steps into more challenging situations, and I kept a lookout for the opportunities that would fit into that plan."
    ]
  ]
}